una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91rm3400.h
/* - ----------------------------------------------------------------------------*/
/* -          ATMEL Microcontroller Software Support  -  ROUSSET  -*/
/* - ----------------------------------------------------------------------------*/
/* -  DISCLAIMER:  THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR*/
/* -  IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF*/
/* -  MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE*/
/* -  DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR ANY DIRECT, INDIRECT,*/
/* -  INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT*/
/* -  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,*/
/* -  OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF*/
/* -  LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING*/
/* -  NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,*/
/* -  EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.*/
/* - ----------------------------------------------------------------------------*/
/* - File Name           : AT91RM3400.h*/
/* - Object              : AT91RM3400 definitions*/
/* - Generated           : AT91 SW Application Group  09/05/2005 (14:05:57)*/
/* - */
/* - CVS Reference       : /AT91RM3400.pl/1.11/Fri Feb  7 10:29:52 2003  */
/* - CVS Reference       : /SYS_0000A.pl/1.1.1.1/Wed Apr 28 12:01:18 2004  */
/* - CVS Reference       : /MC_1760A.pl/1.1/Fri Aug 23 15:38:22 2002  */
/* - CVS Reference       : /AIC_1796B.pl/1.1.1.1/Fri Jun 28 10:36:48 2002  */
/* - CVS Reference       : /PMC_2636A.pl/1.1.1.1/Fri Jun 28 10:36:48 2002  */
/* - CVS Reference       : /ST_1763B.pl/1.1/Fri Aug 23 15:41:42 2002  */
/* - CVS Reference       : /RTC_1245D.pl/1.3/Fri Sep 17 15:10:20 2004  */
/* - CVS Reference       : /PIO_1725D.pl/1.1.1.1/Fri Jun 28 10:36:48 2002  */
/* - CVS Reference       : /DBGU_1754A.pl/1.4/Fri Jan 31 12:18:24 2003  */
/* - CVS Reference       : /UDP_1765B.pl/1.3/Fri Aug  2 15:45:38 2002  */
/* - CVS Reference       : /MCI_1764A.pl/1.4/Tue May 18 13:48:46 2004  */
/* - CVS Reference       : /US_1739C.pl/1.2/Mon Jul 12 18:26:24 2004  */
/* - CVS Reference       : /SPI_AT91RMxxxx.pl/1.3/Tue Nov 26 10:20:30 2002  */
/* - CVS Reference       : /SSC_1762A.pl/1.2/Fri Nov  8 13:26:40 2002  */
/* - CVS Reference       : /TC_1753B.pl/1.7/Fri Feb 18 13:53:44 2005  */
/* - CVS Reference       : /TWI_1761B.pl/1.4/Fri Feb  7 10:30:08 2003  */
/* - CVS Reference       : /PDC_1734B.pl/1.2/Thu Nov 21 16:38:24 2002  */
/* - ----------------------------------------------------------------------------*/

#ifndef AT91RM3400_H
#define AT91RM3400_H

#ifdef __IAR_SYSTEMS_ICC__

typedef volatile unsigned int AT91_REG;/* Hardware register definition*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR System Peripherals*/
/* ******************************************************************************/
typedef struct _AT91S_SYS {
	AT91_REG	 AIC_SMR[32]; 	/* Source Mode Register*/
	AT91_REG	 AIC_SVR[32]; 	/* Source Vector Register*/
	AT91_REG	 AIC_IVR; 	/* IRQ Vector Register*/
	AT91_REG	 AIC_FVR; 	/* FIQ Vector Register*/
	AT91_REG	 AIC_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 AIC_IPR; 	/* Interrupt Pending Register*/
	AT91_REG	 AIC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 AIC_CISR; 	/* Core Interrupt Status Register*/
	AT91_REG	 Reserved0[2]; 	/* */
	AT91_REG	 AIC_IECR; 	/* Interrupt Enable Command Register*/
	AT91_REG	 AIC_IDCR; 	/* Interrupt Disable Command Register*/
	AT91_REG	 AIC_ICCR; 	/* Interrupt Clear Command Register*/
	AT91_REG	 AIC_ISCR; 	/* Interrupt Set Command Register*/
	AT91_REG	 AIC_EOICR; 	/* End of Interrupt Command Register*/
	AT91_REG	 AIC_SPU; 	/* Spurious Vector Register*/
	AT91_REG	 AIC_DCR; 	/* Debug Control Register (Protect)*/
	AT91_REG	 Reserved1[1]; 	/* */
	AT91_REG	 AIC_FFER; 	/* Fast Forcing Enable Register*/
	AT91_REG	 AIC_FFDR; 	/* Fast Forcing Disable Register*/
	AT91_REG	 AIC_FFSR; 	/* Fast Forcing Status Register*/
	AT91_REG	 Reserved2[45]; 	/* */
	AT91_REG	 DBGU_CR; 	/* Control Register*/
	AT91_REG	 DBGU_MR; 	/* Mode Register*/
	AT91_REG	 DBGU_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 DBGU_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 DBGU_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 DBGU_CSR; 	/* Channel Status Register*/
	AT91_REG	 DBGU_RHR; 	/* Receiver Holding Register*/
	AT91_REG	 DBGU_THR; 	/* Transmitter Holding Register*/
	AT91_REG	 DBGU_BRGR; 	/* Baud Rate Generator Register*/
	AT91_REG	 Reserved3[7]; 	/* */
	AT91_REG	 DBGU_C1R; 	/* Chip ID1 Register*/
	AT91_REG	 DBGU_C2R; 	/* Chip ID2 Register*/
	AT91_REG	 DBGU_FNTR; 	/* Force NTRST Register*/
	AT91_REG	 Reserved4[45]; 	/* */
	AT91_REG	 DBGU_RPR; 	/* Receive Pointer Register*/
	AT91_REG	 DBGU_RCR; 	/* Receive Counter Register*/
	AT91_REG	 DBGU_TPR; 	/* Transmit Pointer Register*/
	AT91_REG	 DBGU_TCR; 	/* Transmit Counter Register*/
	AT91_REG	 DBGU_RNPR; 	/* Receive Next Pointer Register*/
	AT91_REG	 DBGU_RNCR; 	/* Receive Next Counter Register*/
	AT91_REG	 DBGU_TNPR; 	/* Transmit Next Pointer Register*/
	AT91_REG	 DBGU_TNCR; 	/* Transmit Next Counter Register*/
	AT91_REG	 DBGU_PTCR; 	/* PDC Transfer Control Register*/
	AT91_REG	 DBGU_PTSR; 	/* PDC Transfer Status Register*/
	AT91_REG	 Reserved5[54]; 	/* */
	AT91_REG	 PIOA_PER; 	/* PIO Enable Register*/
	AT91_REG	 PIOA_PDR; 	/* PIO Disable Register*/
	AT91_REG	 PIOA_PSR; 	/* PIO Status Register*/
	AT91_REG	 Reserved6[1]; 	/* */
	AT91_REG	 PIOA_OER; 	/* Output Enable Register*/
	AT91_REG	 PIOA_ODR; 	/* Output Disable Registerr*/
	AT91_REG	 PIOA_OSR; 	/* Output Status Register*/
	AT91_REG	 Reserved7[1]; 	/* */
	AT91_REG	 PIOA_IFER; 	/* Input Filter Enable Register*/
	AT91_REG	 PIOA_IFDR; 	/* Input Filter Disable Register*/
	AT91_REG	 PIOA_IFSR; 	/* Input Filter Status Register*/
	AT91_REG	 Reserved8[1]; 	/* */
	AT91_REG	 PIOA_SODR; 	/* Set Output Data Register*/
	AT91_REG	 PIOA_CODR; 	/* Clear Output Data Register*/
	AT91_REG	 PIOA_ODSR; 	/* Output Data Status Register*/
	AT91_REG	 PIOA_PDSR; 	/* Pin Data Status Register*/
	AT91_REG	 PIOA_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 PIOA_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 PIOA_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 PIOA_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 PIOA_MDER; 	/* Multi-driver Enable Register*/
	AT91_REG	 PIOA_MDDR; 	/* Multi-driver Disable Register*/
	AT91_REG	 PIOA_MDSR; 	/* Multi-driver Status Register*/
	AT91_REG	 Reserved9[1]; 	/* */
	AT91_REG	 PIOA_PPUDR; 	/* Pull-up Disable Register*/
	AT91_REG	 PIOA_PPUER; 	/* Pull-up Enable Register*/
	AT91_REG	 PIOA_PPUSR; 	/* Pad Pull-up Status Register*/
	AT91_REG	 Reserved10[1]; 	/* */
	AT91_REG	 PIOA_ASR; 	/* Select A Register*/
	AT91_REG	 PIOA_BSR; 	/* Select B Register*/
	AT91_REG	 PIOA_ABSR; 	/* AB Select Status Register*/
	AT91_REG	 Reserved11[9]; 	/* */
	AT91_REG	 PIOA_OWER; 	/* Output Write Enable Register*/
	AT91_REG	 PIOA_OWDR; 	/* Output Write Disable Register*/
	AT91_REG	 PIOA_OWSR; 	/* Output Write Status Register*/
	AT91_REG	 Reserved12[85]; 	/* */
	AT91_REG	 PIOB_PER; 	/* PIO Enable Register*/
	AT91_REG	 PIOB_PDR; 	/* PIO Disable Register*/
	AT91_REG	 PIOB_PSR; 	/* PIO Status Register*/
	AT91_REG	 Reserved13[1]; 	/* */
	AT91_REG	 PIOB_OER; 	/* Output Enable Register*/
	AT91_REG	 PIOB_ODR; 	/* Output Disable Registerr*/
	AT91_REG	 PIOB_OSR; 	/* Output Status Register*/
	AT91_REG	 Reserved14[1]; 	/* */
	AT91_REG	 PIOB_IFER; 	/* Input Filter Enable Register*/
	AT91_REG	 PIOB_IFDR; 	/* Input Filter Disable Register*/
	AT91_REG	 PIOB_IFSR; 	/* Input Filter Status Register*/
	AT91_REG	 Reserved15[1]; 	/* */
	AT91_REG	 PIOB_SODR; 	/* Set Output Data Register*/
	AT91_REG	 PIOB_CODR; 	/* Clear Output Data Register*/
	AT91_REG	 PIOB_ODSR; 	/* Output Data Status Register*/
	AT91_REG	 PIOB_PDSR; 	/* Pin Data Status Register*/
	AT91_REG	 PIOB_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 PIOB_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 PIOB_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 PIOB_ISR; 	/* Interrupt Status Register*/
	AT91_REG	 PIOB_MDER; 	/* Multi-driver Enable Register*/
	AT91_REG	 PIOB_MDDR; 	/* Multi-driver Disable Register*/
	AT91_REG	 PIOB_MDSR; 	/* Multi-driver Status Register*/
	AT91_REG	 Reserved16[1]; 	/* */
	AT91_REG	 PIOB_PPUDR; 	/* Pull-up Disable Register*/
	AT91_REG	 PIOB_PPUER; 	/* Pull-up Enable Register*/
	AT91_REG	 PIOB_PPUSR; 	/* Pad Pull-up Status Register*/
	AT91_REG	 Reserved17[1]; 	/* */
	AT91_REG	 PIOB_ASR; 	/* Select A Register*/
	AT91_REG	 PIOB_BSR; 	/* Select B Register*/
	AT91_REG	 PIOB_ABSR; 	/* AB Select Status Register*/
	AT91_REG	 Reserved18[9]; 	/* */
	AT91_REG	 PIOB_OWER; 	/* Output Write Enable Register*/
	AT91_REG	 PIOB_OWDR; 	/* Output Write Disable Register*/
	AT91_REG	 PIOB_OWSR; 	/* Output Write Status Register*/
	AT91_REG	 Reserved19[341]; 	/* */
	AT91_REG	 PMC_SCER; 	/* System Clock Enable Register*/
	AT91_REG	 PMC_SCDR; 	/* System Clock Disable Register*/
	AT91_REG	 PMC_SCSR; 	/* System Clock Status Register*/
	AT91_REG	 Reserved20[1]; 	/* */
	AT91_REG	 PMC_PCER; 	/* Peripheral Clock Enable Register*/
	AT91_REG	 PMC_PCDR; 	/* Peripheral Clock Disable Register*/
	AT91_REG	 PMC_PCSR; 	/* Peripheral Clock Status Register*/
	AT91_REG	 Reserved21[1]; 	/* */
	AT91_REG	 CKGR_MOR; 	/* Main Oscillator Register*/
	AT91_REG	 CKGR_MCFR; 	/* Main Clock  Frequency Register*/
	AT91_REG	 CKGR_PLLAR; 	/* PLL A Register*/
	AT91_REG	 CKGR_PLLBR; 	/* PLL B Register*/
	AT91_REG	 PMC_MCKR; 	/* Master Clock Register*/
	AT91_REG	 Reserved22[3]; 	/* */
	AT91_REG	 PMC_PCKR[8]; 	/* Programmable Clock Register*/
	AT91_REG	 PMC_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 PMC_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 PMC_SR; 	/* Status Register*/
	AT91_REG	 PMC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 Reserved23[36]; 	/* */
	AT91_REG	 ST_CR; 	/* Control Register*/
	AT91_REG	 ST_PIMR; 	/* Period Interval Mode Register*/
	AT91_REG	 ST_WDMR; 	/* Watchdog Mode Register*/
	AT91_REG	 ST_RTMR; 	/* Real-time Mode Register*/
	AT91_REG	 ST_SR; 	/* Status Register*/
	AT91_REG	 ST_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 ST_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 ST_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 ST_RTAR; 	/* Real-time Alarm Register*/
	AT91_REG	 ST_CRTR; 	/* Current Real-time Register*/
	AT91_REG	 Reserved24[54]; 	/* */
	AT91_REG	 RTC_CR; 	/* Control Register*/
	AT91_REG	 RTC_MR; 	/* Mode Register*/
	AT91_REG	 RTC_TIMR; 	/* Time Register*/
	AT91_REG	 RTC_CALR; 	/* Calendar Register*/
	AT91_REG	 RTC_TIMALR; 	/* Time Alarm Register*/
	AT91_REG	 RTC_CALALR; 	/* Calendar Alarm Register*/
	AT91_REG	 RTC_SR; 	/* Status Register*/
	AT91_REG	 RTC_SCCR; 	/* Status Clear Command Register*/
	AT91_REG	 RTC_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 RTC_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 RTC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 RTC_VER; 	/* Valid Entry Register*/
	AT91_REG	 Reserved25[52]; 	/* */
	AT91_REG	 MC_RCR; 	/* MC Remap Control Register*/
	AT91_REG	 MC_ASR; 	/* MC Abort Status Register*/
	AT91_REG	 MC_AASR; 	/* MC Abort Address Status Register*/
	AT91_REG	 Reserved26[1]; 	/* */
	AT91_REG	 MC_PUIA[16]; 	/* MC Protection Unit Area*/
	AT91_REG	 MC_PUP; 	/* MC Protection Unit Peripherals*/
	AT91_REG	 MC_PUER; 	/* MC Protection Unit Enable Register*/
} AT91S_SYS, *AT91PS_SYS;


/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Memory Controller Interface*/
/* ******************************************************************************/
typedef struct _AT91S_MC {
	AT91_REG	 MC_RCR; 	/* MC Remap Control Register*/
	AT91_REG	 MC_ASR; 	/* MC Abort Status Register*/
	AT91_REG	 MC_AASR; 	/* MC Abort Address Status Register*/
	AT91_REG	 Reserved0[1]; 	/* */
	AT91_REG	 MC_PUIA[16]; 	/* MC Protection Unit Area*/
	AT91_REG	 MC_PUP; 	/* MC Protection Unit Peripherals*/
	AT91_REG	 MC_PUER; 	/* MC Protection Unit Enable Register*/
} AT91S_MC, *AT91PS_MC;

/* -------- MC_RCR : (MC Offset: 0x0) MC Remap Control Register -------- */
#define AT91C_MC_RCB          ((unsigned int) 0x1 <<  0) /* (MC) Remap Command Bit*/
/* -------- MC_ASR : (MC Offset: 0x4) MC Abort Status Register -------- */
#define AT91C_MC_UNDADD       ((unsigned int) 0x1 <<  0) /* (MC) Undefined Addess Abort Status*/
#define AT91C_MC_MISADD       ((unsigned int) 0x1 <<  1) /* (MC) Misaligned Addess Abort Status*/
#define AT91C_MC_MPU          ((unsigned int) 0x1 <<  2) /* (MC) Memory protection Unit Abort Status*/
#define AT91C_MC_ABTSZ        ((unsigned int) 0x3 <<  8) /* (MC) Abort Size Status*/
#define 	AT91C_MC_ABTSZ_BYTE                 ((unsigned int) 0x0 <<  8) /* (MC) Byte*/
#define 	AT91C_MC_ABTSZ_HWORD                ((unsigned int) 0x1 <<  8) /* (MC) Half-word*/
#define 	AT91C_MC_ABTSZ_WORD                 ((unsigned int) 0x2 <<  8) /* (MC) Word*/
#define AT91C_MC_ABTTYP       ((unsigned int) 0x3 << 10) /* (MC) Abort Type Status*/
#define 	AT91C_MC_ABTTYP_DATAR                ((unsigned int) 0x0 << 10) /* (MC) Data Read*/
#define 	AT91C_MC_ABTTYP_DATAW                ((unsigned int) 0x1 << 10) /* (MC) Data Write*/
#define 	AT91C_MC_ABTTYP_FETCH                ((unsigned int) 0x2 << 10) /* (MC) Code Fetch*/
#define AT91C_MC_MST0         ((unsigned int) 0x1 << 16) /* (MC) Master 0 Abort Source*/
#define AT91C_MC_MST1         ((unsigned int) 0x1 << 17) /* (MC) Master 1 Abort Source*/
#define AT91C_MC_SVMST0       ((unsigned int) 0x1 << 24) /* (MC) Saved Master 0 Abort Source*/
#define AT91C_MC_SVMST1       ((unsigned int) 0x1 << 25) /* (MC) Saved Master 1 Abort Source*/
/* -------- MC_PUIA : (MC Offset: 0x10) MC Protection Unit Area -------- */
#define AT91C_MC_PROT         ((unsigned int) 0x3 <<  0) /* (MC) Protection*/
#define 	AT91C_MC_PROT_PNAUNA               ((unsigned int) 0x0) /* (MC) Privilege: No Access, User: No Access*/
#define 	AT91C_MC_PROT_PRWUNA               ((unsigned int) 0x1) /* (MC) Privilege: Read/Write, User: No Access*/
#define 	AT91C_MC_PROT_PRWURO               ((unsigned int) 0x2) /* (MC) Privilege: Read/Write, User: Read Only*/
#define 	AT91C_MC_PROT_PRWURW               ((unsigned int) 0x3) /* (MC) Privilege: Read/Write, User: Read/Write*/
#define AT91C_MC_SIZE         ((unsigned int) 0xF <<  4) /* (MC) Internal Area Size*/
#define 	AT91C_MC_SIZE_1KB                  ((unsigned int) 0x0 <<  4) /* (MC) Area size 1KByte*/
#define 	AT91C_MC_SIZE_2KB                  ((unsigned int) 0x1 <<  4) /* (MC) Area size 2KByte*/
#define 	AT91C_MC_SIZE_4KB                  ((unsigned int) 0x2 <<  4) /* (MC) Area size 4KByte*/
#define 	AT91C_MC_SIZE_8KB                  ((unsigned int) 0x3 <<  4) /* (MC) Area size 8KByte*/
#define 	AT91C_MC_SIZE_16KB                 ((unsigned int) 0x4 <<  4) /* (MC) Area size 16KByte*/
#define 	AT91C_MC_SIZE_32KB                 ((unsigned int) 0x5 <<  4) /* (MC) Area size 32KByte*/
#define 	AT91C_MC_SIZE_64KB                 ((unsigned int) 0x6 <<  4) /* (MC) Area size 64KByte*/
#define 	AT91C_MC_SIZE_128KB                ((unsigned int) 0x7 <<  4) /* (MC) Area size 128KByte*/
#define 	AT91C_MC_SIZE_256KB                ((unsigned int) 0x8 <<  4) /* (MC) Area size 256KByte*/
#define 	AT91C_MC_SIZE_512KB                ((unsigned int) 0x9 <<  4) /* (MC) Area size 512KByte*/
#define 	AT91C_MC_SIZE_1MB                  ((unsigned int) 0xA <<  4) /* (MC) Area size 1MByte*/
#define 	AT91C_MC_SIZE_2MB                  ((unsigned int) 0xB <<  4) /* (MC) Area size 2MByte*/
#define 	AT91C_MC_SIZE_4MB                  ((unsigned int) 0xC <<  4) /* (MC) Area size 4MByte*/
#define 	AT91C_MC_SIZE_8MB                  ((unsigned int) 0xD <<  4) /* (MC) Area size 8MByte*/
#define 	AT91C_MC_SIZE_16MB                 ((unsigned int) 0xE <<  4) /* (MC) Area size 16MByte*/
#define 	AT91C_MC_SIZE_64MB                 ((unsigned int) 0xF <<  4) /* (MC) Area size 64MByte*/
#define AT91C_MC_BA           ((unsigned int) 0x3FFFF << 10) /* (MC) Internal Area Base Address*/
/* -------- MC_PUP : (MC Offset: 0x50) MC Protection Unit Peripheral -------- */
/* -------- MC_PUER : (MC Offset: 0x54) MC Protection Unit Area -------- */
#define AT91C_MC_PUEB         ((unsigned int) 0x1 <<  0) /* (MC) Protection Unit enable Bit*/

/* ******************************************************************************/
/*              SOFTWARE API DEFINITION  FOR Real-time Clock Alarm and Parallel Load Interface*/
/* ******************************************************************************/
typedef struct _AT91S_RTC {
	AT91_REG	 RTC_CR; 	/* Control Register*/
	AT91_REG	 RTC_MR; 	/* Mode Register*/
	AT91_REG	 RTC_TIMR; 	/* Time Register*/
	AT91_REG	 RTC_CALR; 	/* Calendar Register*/
	AT91_REG	 RTC_TIMALR; 	/* Time Alarm Register*/
	AT91_REG	 RTC_CALALR; 	/* Calendar Alarm Register*/
	AT91_REG	 RTC_SR; 	/* Status Register*/
	AT91_REG	 RTC_SCCR; 	/* Status Clear Command Register*/
	AT91_REG	 RTC_IER; 	/* Interrupt Enable Register*/
	AT91_REG	 RTC_IDR; 	/* Interrupt Disable Register*/
	AT91_REG	 RTC_IMR; 	/* Interrupt Mask Register*/
	AT91_REG	 RTC_VER; 	/* Valid Entry Register*/
} AT91S_RTC, *AT91PS_RTC;

