una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91rm3400.h
#define AT91C_SSC0_RC0R ((AT91_REG *) 	0xFFFD0038) /* (SSC0) Receive Compare 0 Register*/
#define AT91C_SSC0_RCMR ((AT91_REG *) 	0xFFFD0010) /* (SSC0) Receive Clock ModeRegister*/
#define AT91C_SSC0_RC1R ((AT91_REG *) 	0xFFFD003C) /* (SSC0) Receive Compare 1 Register*/
#define AT91C_SSC0_IER  ((AT91_REG *) 	0xFFFD0044) /* (SSC0) Interrupt Enable Register*/
#define AT91C_SSC0_CR   ((AT91_REG *) 	0xFFFD0000) /* (SSC0) Control Register*/
#define AT91C_SSC0_TFMR ((AT91_REG *) 	0xFFFD001C) /* (SSC0) Transmit Frame Mode Register*/
#define AT91C_SSC0_RHR  ((AT91_REG *) 	0xFFFD0020) /* (SSC0) Receive Holding Register*/
#define AT91C_SSC0_IMR  ((AT91_REG *) 	0xFFFD004C) /* (SSC0) Interrupt Mask Register*/
#define AT91C_SSC0_TCMR ((AT91_REG *) 	0xFFFD0018) /* (SSC0) Transmit Clock Mode Register*/
#define AT91C_SSC0_RSHR ((AT91_REG *) 	0xFFFD0030) /* (SSC0) Receive Sync Holding Register*/
#define AT91C_SSC0_RFMR ((AT91_REG *) 	0xFFFD0014) /* (SSC0) Receive Frame Mode Register*/
#define AT91C_SSC0_TSHR ((AT91_REG *) 	0xFFFD0034) /* (SSC0) Transmit Sync Holding Register*/
/* ========== Register definition for PDC_US3 peripheral ========== */
#define AT91C_US3_PTCR  ((AT91_REG *) 	0xFFFCC120) /* (PDC_US3) PDC Transfer Control Register*/
#define AT91C_US3_RNPR  ((AT91_REG *) 	0xFFFCC110) /* (PDC_US3) Receive Next Pointer Register*/
#define AT91C_US3_RCR   ((AT91_REG *) 	0xFFFCC104) /* (PDC_US3) Receive Counter Register*/
#define AT91C_US3_TPR   ((AT91_REG *) 	0xFFFCC108) /* (PDC_US3) Transmit Pointer Register*/
#define AT91C_US3_PTSR  ((AT91_REG *) 	0xFFFCC124) /* (PDC_US3) PDC Transfer Status Register*/
#define AT91C_US3_TNCR  ((AT91_REG *) 	0xFFFCC11C) /* (PDC_US3) Transmit Next Counter Register*/
#define AT91C_US3_RPR   ((AT91_REG *) 	0xFFFCC100) /* (PDC_US3) Receive Pointer Register*/
#define AT91C_US3_TCR   ((AT91_REG *) 	0xFFFCC10C) /* (PDC_US3) Transmit Counter Register*/
#define AT91C_US3_RNCR  ((AT91_REG *) 	0xFFFCC114) /* (PDC_US3) Receive Next Counter Register*/
#define AT91C_US3_TNPR  ((AT91_REG *) 	0xFFFCC118) /* (PDC_US3) Transmit Next Pointer Register*/
/* ========== Register definition for US3 peripheral ========== */
#define AT91C_US3_CSR   ((AT91_REG *) 	0xFFFCC014) /* (US3) Channel Status Register*/
#define AT91C_US3_IER   ((AT91_REG *) 	0xFFFCC008) /* (US3) Interrupt Enable Register*/
#define AT91C_US3_IMR   ((AT91_REG *) 	0xFFFCC010) /* (US3) Interrupt Mask Register*/
#define AT91C_US3_THR   ((AT91_REG *) 	0xFFFCC01C) /* (US3) Transmitter Holding Register*/
#define AT91C_US3_BRGR  ((AT91_REG *) 	0xFFFCC020) /* (US3) Baud Rate Generator Register*/
#define AT91C_US3_RTOR  ((AT91_REG *) 	0xFFFCC024) /* (US3) Receiver Time-out Register*/
#define AT91C_US3_IDR   ((AT91_REG *) 	0xFFFCC00C) /* (US3) Interrupt Disable Register*/
#define AT91C_US3_FIDI  ((AT91_REG *) 	0xFFFCC040) /* (US3) FI_DI_Ratio Register*/
#define AT91C_US3_RHR   ((AT91_REG *) 	0xFFFCC018) /* (US3) Receiver Holding Register*/
#define AT91C_US3_NER   ((AT91_REG *) 	0xFFFCC044) /* (US3) Nb Errors Register*/
#define AT91C_US3_XXR   ((AT91_REG *) 	0xFFFCC048) /* (US3) XON_XOFF Register*/
#define AT91C_US3_IF    ((AT91_REG *) 	0xFFFCC04C) /* (US3) IRDA_FILTER Register*/
#define AT91C_US3_TTGR  ((AT91_REG *) 	0xFFFCC028) /* (US3) Transmitter Time-guard Register*/
#define AT91C_US3_CR    ((AT91_REG *) 	0xFFFCC000) /* (US3) Control Register*/
#define AT91C_US3_MR    ((AT91_REG *) 	0xFFFCC004) /* (US3) Mode Register*/
/* ========== Register definition for PDC_US2 peripheral ========== */
#define AT91C_US2_PTCR  ((AT91_REG *) 	0xFFFC8120) /* (PDC_US2) PDC Transfer Control Register*/
#define AT91C_US2_TCR   ((AT91_REG *) 	0xFFFC810C) /* (PDC_US2) Transmit Counter Register*/
#define AT91C_US2_RPR   ((AT91_REG *) 	0xFFFC8100) /* (PDC_US2) Receive Pointer Register*/
#define AT91C_US2_TPR   ((AT91_REG *) 	0xFFFC8108) /* (PDC_US2) Transmit Pointer Register*/
#define AT91C_US2_PTSR  ((AT91_REG *) 	0xFFFC8124) /* (PDC_US2) PDC Transfer Status Register*/
#define AT91C_US2_RNCR  ((AT91_REG *) 	0xFFFC8114) /* (PDC_US2) Receive Next Counter Register*/
#define AT91C_US2_TNPR  ((AT91_REG *) 	0xFFFC8118) /* (PDC_US2) Transmit Next Pointer Register*/
#define AT91C_US2_RCR   ((AT91_REG *) 	0xFFFC8104) /* (PDC_US2) Receive Counter Register*/
#define AT91C_US2_RNPR  ((AT91_REG *) 	0xFFFC8110) /* (PDC_US2) Receive Next Pointer Register*/
#define AT91C_US2_TNCR  ((AT91_REG *) 	0xFFFC811C) /* (PDC_US2) Transmit Next Counter Register*/
/* ========== Register definition for US2 peripheral ========== */
#define AT91C_US2_RHR   ((AT91_REG *) 	0xFFFC8018) /* (US2) Receiver Holding Register*/
#define AT91C_US2_BRGR  ((AT91_REG *) 	0xFFFC8020) /* (US2) Baud Rate Generator Register*/
#define AT91C_US2_IF    ((AT91_REG *) 	0xFFFC804C) /* (US2) IRDA_FILTER Register*/
#define AT91C_US2_IDR   ((AT91_REG *) 	0xFFFC800C) /* (US2) Interrupt Disable Register*/
#define AT91C_US2_IMR   ((AT91_REG *) 	0xFFFC8010) /* (US2) Interrupt Mask Register*/
#define AT91C_US2_CR    ((AT91_REG *) 	0xFFFC8000) /* (US2) Control Register*/
#define AT91C_US2_IER   ((AT91_REG *) 	0xFFFC8008) /* (US2) Interrupt Enable Register*/
#define AT91C_US2_NER   ((AT91_REG *) 	0xFFFC8044) /* (US2) Nb Errors Register*/
#define AT91C_US2_RTOR  ((AT91_REG *) 	0xFFFC8024) /* (US2) Receiver Time-out Register*/
#define AT91C_US2_TTGR  ((AT91_REG *) 	0xFFFC8028) /* (US2) Transmitter Time-guard Register*/
#define AT91C_US2_MR    ((AT91_REG *) 	0xFFFC8004) /* (US2) Mode Register*/
#define AT91C_US2_CSR   ((AT91_REG *) 	0xFFFC8014) /* (US2) Channel Status Register*/
#define AT91C_US2_XXR   ((AT91_REG *) 	0xFFFC8048) /* (US2) XON_XOFF Register*/
#define AT91C_US2_THR   ((AT91_REG *) 	0xFFFC801C) /* (US2) Transmitter Holding Register*/
#define AT91C_US2_FIDI  ((AT91_REG *) 	0xFFFC8040) /* (US2) FI_DI_Ratio Register*/
/* ========== Register definition for PDC_US1 peripheral ========== */
#define AT91C_US1_RNCR  ((AT91_REG *) 	0xFFFC4114) /* (PDC_US1) Receive Next Counter Register*/
#define AT91C_US1_PTCR  ((AT91_REG *) 	0xFFFC4120) /* (PDC_US1) PDC Transfer Control Register*/
#define AT91C_US1_TCR   ((AT91_REG *) 	0xFFFC410C) /* (PDC_US1) Transmit Counter Register*/
#define AT91C_US1_PTSR  ((AT91_REG *) 	0xFFFC4124) /* (PDC_US1) PDC Transfer Status Register*/
#define AT91C_US1_TNPR  ((AT91_REG *) 	0xFFFC4118) /* (PDC_US1) Transmit Next Pointer Register*/
#define AT91C_US1_RCR   ((AT91_REG *) 	0xFFFC4104) /* (PDC_US1) Receive Counter Register*/
#define AT91C_US1_RNPR  ((AT91_REG *) 	0xFFFC4110) /* (PDC_US1) Receive Next Pointer Register*/
#define AT91C_US1_RPR   ((AT91_REG *) 	0xFFFC4100) /* (PDC_US1) Receive Pointer Register*/
#define AT91C_US1_TNCR  ((AT91_REG *) 	0xFFFC411C) /* (PDC_US1) Transmit Next Counter Register*/
#define AT91C_US1_TPR   ((AT91_REG *) 	0xFFFC4108) /* (PDC_US1) Transmit Pointer Register*/
/* ========== Register definition for US1 peripheral ========== */
#define AT91C_US1_IF    ((AT91_REG *) 	0xFFFC404C) /* (US1) IRDA_FILTER Register*/
#define AT91C_US1_NER   ((AT91_REG *) 	0xFFFC4044) /* (US1) Nb Errors Register*/
#define AT91C_US1_RTOR  ((AT91_REG *) 	0xFFFC4024) /* (US1) Receiver Time-out Register*/
#define AT91C_US1_CSR   ((AT91_REG *) 	0xFFFC4014) /* (US1) Channel Status Register*/
#define AT91C_US1_IDR   ((AT91_REG *) 	0xFFFC400C) /* (US1) Interrupt Disable Register*/
#define AT91C_US1_IER   ((AT91_REG *) 	0xFFFC4008) /* (US1) Interrupt Enable Register*/
#define AT91C_US1_THR   ((AT91_REG *) 	0xFFFC401C) /* (US1) Transmitter Holding Register*/
#define AT91C_US1_XXR   ((AT91_REG *) 	0xFFFC4048) /* (US1) XON_XOFF Register*/
#define AT91C_US1_TTGR  ((AT91_REG *) 	0xFFFC4028) /* (US1) Transmitter Time-guard Register*/
#define AT91C_US1_RHR   ((AT91_REG *) 	0xFFFC4018) /* (US1) Receiver Holding Register*/
#define AT91C_US1_BRGR  ((AT91_REG *) 	0xFFFC4020) /* (US1) Baud Rate Generator Register*/
#define AT91C_US1_IMR   ((AT91_REG *) 	0xFFFC4010) /* (US1) Interrupt Mask Register*/
#define AT91C_US1_FIDI  ((AT91_REG *) 	0xFFFC4040) /* (US1) FI_DI_Ratio Register*/
#define AT91C_US1_CR    ((AT91_REG *) 	0xFFFC4000) /* (US1) Control Register*/
#define AT91C_US1_MR    ((AT91_REG *) 	0xFFFC4004) /* (US1) Mode Register*/
/* ========== Register definition for PDC_US0 peripheral ========== */
#define AT91C_US0_TNPR  ((AT91_REG *) 	0xFFFC0118) /* (PDC_US0) Transmit Next Pointer Register*/
#define AT91C_US0_RNPR  ((AT91_REG *) 	0xFFFC0110) /* (PDC_US0) Receive Next Pointer Register*/
#define AT91C_US0_TCR   ((AT91_REG *) 	0xFFFC010C) /* (PDC_US0) Transmit Counter Register*/
#define AT91C_US0_PTCR  ((AT91_REG *) 	0xFFFC0120) /* (PDC_US0) PDC Transfer Control Register*/
#define AT91C_US0_PTSR  ((AT91_REG *) 	0xFFFC0124) /* (PDC_US0) PDC Transfer Status Register*/
#define AT91C_US0_TNCR  ((AT91_REG *) 	0xFFFC011C) /* (PDC_US0) Transmit Next Counter Register*/
#define AT91C_US0_TPR   ((AT91_REG *) 	0xFFFC0108) /* (PDC_US0) Transmit Pointer Register*/
#define AT91C_US0_RCR   ((AT91_REG *) 	0xFFFC0104) /* (PDC_US0) Receive Counter Register*/
#define AT91C_US0_RPR   ((AT91_REG *) 	0xFFFC0100) /* (PDC_US0) Receive Pointer Register*/
#define AT91C_US0_RNCR  ((AT91_REG *) 	0xFFFC0114) /* (PDC_US0) Receive Next Counter Register*/
/* ========== Register definition for US0 peripheral ========== */
#define AT91C_US0_XXR   ((AT91_REG *) 	0xFFFC0048) /* (US0) XON_XOFF Register*/
#define AT91C_US0_BRGR  ((AT91_REG *) 	0xFFFC0020) /* (US0) Baud Rate Generator Register*/
#define AT91C_US0_NER   ((AT91_REG *) 	0xFFFC0044) /* (US0) Nb Errors Register*/
#define AT91C_US0_CR    ((AT91_REG *) 	0xFFFC0000) /* (US0) Control Register*/
#define AT91C_US0_IMR   ((AT91_REG *) 	0xFFFC0010) /* (US0) Interrupt Mask Register*/
#define AT91C_US0_FIDI  ((AT91_REG *) 	0xFFFC0040) /* (US0) FI_DI_Ratio Register*/
#define AT91C_US0_TTGR  ((AT91_REG *) 	0xFFFC0028) /* (US0) Transmitter Time-guard Register*/
#define AT91C_US0_MR    ((AT91_REG *) 	0xFFFC0004) /* (US0) Mode Register*/
#define AT91C_US0_RTOR  ((AT91_REG *) 	0xFFFC0024) /* (US0) Receiver Time-out Register*/
#define AT91C_US0_CSR   ((AT91_REG *) 	0xFFFC0014) /* (US0) Channel Status Register*/
#define AT91C_US0_RHR   ((AT91_REG *) 	0xFFFC0018) /* (US0) Receiver Holding Register*/
#define AT91C_US0_IDR   ((AT91_REG *) 	0xFFFC000C) /* (US0) Interrupt Disable Register*/
#define AT91C_US0_THR   ((AT91_REG *) 	0xFFFC001C) /* (US0) Transmitter Holding Register*/
#define AT91C_US0_IF    ((AT91_REG *) 	0xFFFC004C) /* (US0) IRDA_FILTER Register*/
#define AT91C_US0_IER   ((AT91_REG *) 	0xFFFC0008) /* (US0) Interrupt Enable Register*/
/* ========== Register definition for TWI peripheral ========== */
#define AT91C_TWI_IER   ((AT91_REG *) 	0xFFFB8024) /* (TWI) Interrupt Enable Register*/
#define AT91C_TWI_CR    ((AT91_REG *) 	0xFFFB8000) /* (TWI) Control Register*/
#define AT91C_TWI_SR    ((AT91_REG *) 	0xFFFB8020) /* (TWI) Status Register*/
#define AT91C_TWI_IMR   ((AT91_REG *) 	0xFFFB802C) /* (TWI) Interrupt Mask Register*/
#define AT91C_TWI_THR   ((AT91_REG *) 	0xFFFB8034) /* (TWI) Transmit Holding Register*/
#define AT91C_TWI_IDR   ((AT91_REG *) 	0xFFFB8028) /* (TWI) Interrupt Disable Register*/
#define AT91C_TWI_IADR  ((AT91_REG *) 	0xFFFB800C) /* (TWI) Internal Address Register*/
#define AT91C_TWI_MMR   ((AT91_REG *) 	0xFFFB8004) /* (TWI) Master Mode Register*/
#define AT91C_TWI_CWGR  ((AT91_REG *) 	0xFFFB8010) /* (TWI) Clock Waveform Generator Register*/
#define AT91C_TWI_RHR   ((AT91_REG *) 	0xFFFB8030) /* (TWI) Receive Holding Register*/
#define AT91C_TWI_SMR   ((AT91_REG *) 	0xFFFB8008) /* (TWI) Slave Mode Register*/
/* ========== Register definition for PDC_MCI peripheral ========== */
#define AT91C_MCI_PTCR  ((AT91_REG *) 	0xFFFB4120) /* (PDC_MCI) PDC Transfer Control Register*/
#define AT91C_MCI_RCR   ((AT91_REG *) 	0xFFFB4104) /* (PDC_MCI) Receive Counter Register*/
#define AT91C_MCI_RPR   ((AT91_REG *) 	0xFFFB4100) /* (PDC_MCI) Receive Pointer Register*/
#define AT91C_MCI_PTSR  ((AT91_REG *) 	0xFFFB4124) /* (PDC_MCI) PDC Transfer Status Register*/
#define AT91C_MCI_TPR   ((AT91_REG *) 	0xFFFB4108) /* (PDC_MCI) Transmit Pointer Register*/
#define AT91C_MCI_TCR   ((AT91_REG *) 	0xFFFB410C) /* (PDC_MCI) Transmit Counter Register*/
#define AT91C_MCI_RNPR  ((AT91_REG *) 	0xFFFB4110) /* (PDC_MCI) Receive Next Pointer Register*/
#define AT91C_MCI_TNCR  ((AT91_REG *) 	0xFFFB411C) /* (PDC_MCI) Transmit Next Counter Register*/
#define AT91C_MCI_RNCR  ((AT91_REG *) 	0xFFFB4114) /* (PDC_MCI) Receive Next Counter Register*/
#define AT91C_MCI_TNPR  ((AT91_REG *) 	0xFFFB4118) /* (PDC_MCI) Transmit Next Pointer Register*/
/* ========== Register definition for MCI peripheral ========== */
#define AT91C_MCI_TDR   ((AT91_REG *) 	0xFFFB4034) /* (MCI) MCI Transmit Data Register*/
#define AT91C_MCI_RSPR  ((AT91_REG *) 	0xFFFB4020) /* (MCI) MCI Response Register*/
#define AT91C_MCI_SDCR  ((AT91_REG *) 	0xFFFB400C) /* (MCI) MCI SD Card Register*/
#define AT91C_MCI_MR    ((AT91_REG *) 	0xFFFB4004) /* (MCI) MCI Mode Register*/
#define AT91C_MCI_CR    ((AT91_REG *) 	0xFFFB4000) /* (MCI) MCI Control Register*/
#define AT91C_MCI_ARGR  ((AT91_REG *) 	0xFFFB4010) /* (MCI) MCI Argument Register*/
#define AT91C_MCI_SR    ((AT91_REG *) 	0xFFFB4040) /* (MCI) MCI Status Register*/
#define AT91C_MCI_RDR   ((AT91_REG *) 	0xFFFB4030) /* (MCI) MCI Receive Data Register*/
#define AT91C_MCI_DTOR  ((AT91_REG *) 	0xFFFB4008) /* (MCI) MCI Data Timeout Register*/
#define AT91C_MCI_CMDR  ((AT91_REG *) 	0xFFFB4014) /* (MCI) MCI Command Register*/
#define AT91C_MCI_IMR   ((AT91_REG *) 	0xFFFB404C) /* (MCI) MCI Interrupt Mask Register*/
#define AT91C_MCI_IER   ((AT91_REG *) 	0xFFFB4044) /* (MCI) MCI Interrupt Enable Register*/
#define AT91C_MCI_IDR   ((AT91_REG *) 	0xFFFB4048) /* (MCI) MCI Interrupt Disable Register*/
/* ========== Register definition for UDP peripheral ========== */
#define AT91C_UDP_IMR   ((AT91_REG *) 	0xFFFB0018) /* (UDP) Interrupt Mask Register*/
#define AT91C_UDP_FADDR ((AT91_REG *) 	0xFFFB0008) /* (UDP) Function Address Register*/
#define AT91C_UDP_NUM   ((AT91_REG *) 	0xFFFB0000) /* (UDP) Frame Number Register*/
#define AT91C_UDP_FDR   ((AT91_REG *) 	0xFFFB0050) /* (UDP) Endpoint FIFO Data Register*/
#define AT91C_UDP_ISR   ((AT91_REG *) 	0xFFFB001C) /* (UDP) Interrupt Status Register*/
#define AT91C_UDP_CSR   ((AT91_REG *) 	0xFFFB0030) /* (UDP) Endpoint Control and Status Register*/
#define AT91C_UDP_IDR   ((AT91_REG *) 	0xFFFB0014) /* (UDP) Interrupt Disable Register*/
#define AT91C_UDP_ICR   ((AT91_REG *) 	0xFFFB0020) /* (UDP) Interrupt Clear Register*/
#define AT91C_UDP_RSTEP ((AT91_REG *) 	0xFFFB0028) /* (UDP) Reset Endpoint Register*/
#define AT91C_UDP_GLBSTATE ((AT91_REG *) 	0xFFFB0004) /* (UDP) Global State Register*/
#define AT91C_UDP_IER   ((AT91_REG *) 	0xFFFB0010) /* (UDP) Interrupt Enable Register*/
/* ========== Register definition for TC5 peripheral ========== */
#define AT91C_TC5_CMR   ((AT91_REG *) 	0xFFFA4084) /* (TC5) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC5_IDR   ((AT91_REG *) 	0xFFFA40A8) /* (TC5) Interrupt Disable Register*/
#define AT91C_TC5_CCR   ((AT91_REG *) 	0xFFFA4080) /* (TC5) Channel Control Register*/
#define AT91C_TC5_RB    ((AT91_REG *) 	0xFFFA4098) /* (TC5) Register B*/
#define AT91C_TC5_IMR   ((AT91_REG *) 	0xFFFA40AC) /* (TC5) Interrupt Mask Register*/
#define AT91C_TC5_CV    ((AT91_REG *) 	0xFFFA4090) /* (TC5) Counter Value*/
#define AT91C_TC5_RC    ((AT91_REG *) 	0xFFFA409C) /* (TC5) Register C*/
#define AT91C_TC5_SR    ((AT91_REG *) 	0xFFFA40A0) /* (TC5) Status Register*/
#define AT91C_TC5_IER   ((AT91_REG *) 	0xFFFA40A4) /* (TC5) Interrupt Enable Register*/
#define AT91C_TC5_RA    ((AT91_REG *) 	0xFFFA4094) /* (TC5) Register A*/
/* ========== Register definition for TC4 peripheral ========== */
#define AT91C_TC4_SR    ((AT91_REG *) 	0xFFFA4060) /* (TC4) Status Register*/
#define AT91C_TC4_RA    ((AT91_REG *) 	0xFFFA4054) /* (TC4) Register A*/
#define AT91C_TC4_CV    ((AT91_REG *) 	0xFFFA4050) /* (TC4) Counter Value*/
#define AT91C_TC4_CMR   ((AT91_REG *) 	0xFFFA4044) /* (TC4) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC4_RB    ((AT91_REG *) 	0xFFFA4058) /* (TC4) Register B*/
#define AT91C_TC4_CCR   ((AT91_REG *) 	0xFFFA4040) /* (TC4) Channel Control Register*/
#define AT91C_TC4_IER   ((AT91_REG *) 	0xFFFA4064) /* (TC4) Interrupt Enable Register*/
#define AT91C_TC4_IMR   ((AT91_REG *) 	0xFFFA406C) /* (TC4) Interrupt Mask Register*/
#define AT91C_TC4_RC    ((AT91_REG *) 	0xFFFA405C) /* (TC4) Register C*/
#define AT91C_TC4_IDR   ((AT91_REG *) 	0xFFFA4068) /* (TC4) Interrupt Disable Register*/
/* ========== Register definition for TC3 peripheral ========== */
#define AT91C_TC3_IMR   ((AT91_REG *) 	0xFFFA402C) /* (TC3) Interrupt Mask Register*/
#define AT91C_TC3_CMR   ((AT91_REG *) 	0xFFFA4004) /* (TC3) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC3_IDR   ((AT91_REG *) 	0xFFFA4028) /* (TC3) Interrupt Disable Register*/
#define AT91C_TC3_CCR   ((AT91_REG *) 	0xFFFA4000) /* (TC3) Channel Control Register*/
#define AT91C_TC3_RA    ((AT91_REG *) 	0xFFFA4014) /* (TC3) Register A*/
#define AT91C_TC3_RB    ((AT91_REG *) 	0xFFFA4018) /* (TC3) Register B*/
#define AT91C_TC3_CV    ((AT91_REG *) 	0xFFFA4010) /* (TC3) Counter Value*/
#define AT91C_TC3_SR    ((AT91_REG *) 	0xFFFA4020) /* (TC3) Status Register*/
#define AT91C_TC3_IER   ((AT91_REG *) 	0xFFFA4024) /* (TC3) Interrupt Enable Register*/
#define AT91C_TC3_RC    ((AT91_REG *) 	0xFFFA401C) /* (TC3) Register C*/
/* ========== Register definition for TCB1 peripheral ========== */
#define AT91C_TCB1_BMR  ((AT91_REG *) 	0xFFFA40C4) /* (TCB1) TC Block Mode Register*/
#define AT91C_TCB1_BCR  ((AT91_REG *) 	0xFFFA40C0) /* (TCB1) TC Block Control Register*/
/* ========== Register definition for TC2 peripheral ========== */
#define AT91C_TC2_CMR   ((AT91_REG *) 	0xFFFA0084) /* (TC2) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC2_CCR   ((AT91_REG *) 	0xFFFA0080) /* (TC2) Channel Control Register*/
#define AT91C_TC2_CV    ((AT91_REG *) 	0xFFFA0090) /* (TC2) Counter Value*/
#define AT91C_TC2_RA    ((AT91_REG *) 	0xFFFA0094) /* (TC2) Register A*/
#define AT91C_TC2_RB    ((AT91_REG *) 	0xFFFA0098) /* (TC2) Register B*/
#define AT91C_TC2_IDR   ((AT91_REG *) 	0xFFFA00A8) /* (TC2) Interrupt Disable Register*/
#define AT91C_TC2_IMR   ((AT91_REG *) 	0xFFFA00AC) /* (TC2) Interrupt Mask Register*/
#define AT91C_TC2_RC    ((AT91_REG *) 	0xFFFA009C) /* (TC2) Register C*/
#define AT91C_TC2_IER   ((AT91_REG *) 	0xFFFA00A4) /* (TC2) Interrupt Enable Register*/
#define AT91C_TC2_SR    ((AT91_REG *) 	0xFFFA00A0) /* (TC2) Status Register*/
/* ========== Register definition for TC1 peripheral ========== */
#define AT91C_TC1_RB    ((AT91_REG *) 	0xFFFA0058) /* (TC1) Register B*/
#define AT91C_TC1_CCR   ((AT91_REG *) 	0xFFFA0040) /* (TC1) Channel Control Register*/
#define AT91C_TC1_IER   ((AT91_REG *) 	0xFFFA0064) /* (TC1) Interrupt Enable Register*/
#define AT91C_TC1_IDR   ((AT91_REG *) 	0xFFFA0068) /* (TC1) Interrupt Disable Register*/
#define AT91C_TC1_SR    ((AT91_REG *) 	0xFFFA0060) /* (TC1) Status Register*/
#define AT91C_TC1_CMR   ((AT91_REG *) 	0xFFFA0044) /* (TC1) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC1_RA    ((AT91_REG *) 	0xFFFA0054) /* (TC1) Register A*/
#define AT91C_TC1_RC    ((AT91_REG *) 	0xFFFA005C) /* (TC1) Register C*/
#define AT91C_TC1_IMR   ((AT91_REG *) 	0xFFFA006C) /* (TC1) Interrupt Mask Register*/
#define AT91C_TC1_CV    ((AT91_REG *) 	0xFFFA0050) /* (TC1) Counter Value*/
/* ========== Register definition for TC0 peripheral ========== */
#define AT91C_TC0_SR    ((AT91_REG *) 	0xFFFA0020) /* (TC0) Status Register*/
#define AT91C_TC0_RC    ((AT91_REG *) 	0xFFFA001C) /* (TC0) Register C*/
#define AT91C_TC0_RB    ((AT91_REG *) 	0xFFFA0018) /* (TC0) Register B*/
#define AT91C_TC0_CCR   ((AT91_REG *) 	0xFFFA0000) /* (TC0) Channel Control Register*/
#define AT91C_TC0_CMR   ((AT91_REG *) 	0xFFFA0004) /* (TC0) Channel Mode Register (Capture Mode / Waveform Mode)*/
#define AT91C_TC0_IER   ((AT91_REG *) 	0xFFFA0024) /* (TC0) Interrupt Enable Register*/
#define AT91C_TC0_RA    ((AT91_REG *) 	0xFFFA0014) /* (TC0) Register A*/
#define AT91C_TC0_IDR   ((AT91_REG *) 	0xFFFA0028) /* (TC0) Interrupt Disable Register*/
#define AT91C_TC0_CV    ((AT91_REG *) 	0xFFFA0010) /* (TC0) Counter Value*/
#define AT91C_TC0_IMR   ((AT91_REG *) 	0xFFFA002C) /* (TC0) Interrupt Mask Register*/
/* ========== Register definition for TCB0 peripheral ========== */
#define AT91C_TCB0_BMR  ((AT91_REG *) 	0xFFFA00C4) /* (TCB0) TC Block Mode Register*/
#define AT91C_TCB0_BCR  ((AT91_REG *) 	0xFFFA00C0) /* (TCB0) TC Block Control Register*/

