una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91rm3400.h
/* ******************************************************************************/
/*               PIO DEFINITIONS FOR AT91RM3400*/
/* ******************************************************************************/
#define AT91C_PIO_PA0        ((unsigned int) 1 <<  0) /* Pin Controlled by PA0*/
#define AT91C_PA0_MISO     ((unsigned int) AT91C_PIO_PA0) /*  SPI Master In Slave*/
#define AT91C_PIO_PA1        ((unsigned int) 1 <<  1) /* Pin Controlled by PA1*/
#define AT91C_PA1_MOSI     ((unsigned int) AT91C_PIO_PA1) /*  SPI Master Out Slave*/
#define AT91C_PIO_PA10       ((unsigned int) 1 << 10) /* Pin Controlled by PA10*/
#define AT91C_PA10_RXD0     ((unsigned int) AT91C_PIO_PA10) /*  USART 0 Receive Data*/
#define AT91C_PA10_UTXOEN   ((unsigned int) AT91C_PIO_PA10) /*  USB device TXOEN*/
#define AT91C_PIO_PA11       ((unsigned int) 1 << 11) /* Pin Controlled by PA11*/
#define AT91C_PA11_SCK0     ((unsigned int) AT91C_PIO_PA11) /*  USART 0 Serial Clock*/
#define AT91C_PA11_TCLK0    ((unsigned int) AT91C_PIO_PA11) /*  Timer Counter 0 external clock input*/
#define AT91C_PIO_PA12       ((unsigned int) 1 << 12) /* Pin Controlled by PA12*/
#define AT91C_PA12_CTS0     ((unsigned int) AT91C_PIO_PA12) /*  USART 0 Clear To Send*/
#define AT91C_PA12_TCLK1    ((unsigned int) AT91C_PIO_PA12) /*  Timer Counter 1 external clock input*/
#define AT91C_PIO_PA13       ((unsigned int) 1 << 13) /* Pin Controlled by PA13*/
#define AT91C_PA13_RTS0     ((unsigned int) AT91C_PIO_PA13) /*  USART 0 Ready To Send*/
#define AT91C_PA13_TCLK2    ((unsigned int) AT91C_PIO_PA13) /*  Timer Counter 2 external clock input*/
#define AT91C_PIO_PA14       ((unsigned int) 1 << 14) /* Pin Controlled by PA14*/
#define AT91C_PA14_RXD1     ((unsigned int) AT91C_PIO_PA14) /*  USART 1 Receive Data*/
#define AT91C_PIO_PA15       ((unsigned int) 1 << 15) /* Pin Controlled by PA15*/
#define AT91C_PA15_TXD1     ((unsigned int) AT91C_PIO_PA15) /*  USART 1 Transmit Data*/
#define AT91C_PIO_PA16       ((unsigned int) 1 << 16) /* Pin Controlled by PA16*/
#define AT91C_PA16_RTS1     ((unsigned int) AT91C_PIO_PA16) /*  USART 1 Ready To Send*/
#define AT91C_PA16_TIOA0    ((unsigned int) AT91C_PIO_PA16) /*  Timer Counter 0 Multipurpose Timer I/O Pin A*/
#define AT91C_PIO_PA17       ((unsigned int) 1 << 17) /* Pin Controlled by PA17*/
#define AT91C_PA17_CTS1     ((unsigned int) AT91C_PIO_PA17) /*  USART 1 Clear To Send*/
#define AT91C_PA17_TIOB0    ((unsigned int) AT91C_PIO_PA17) /*  Timer Counter 0 Multipurpose Timer I/O Pin B*/
#define AT91C_PIO_PA18       ((unsigned int) 1 << 18) /* Pin Controlled by PA18*/
#define AT91C_PA18_DTR1     ((unsigned int) AT91C_PIO_PA18) /*  USART 1 Data Terminal ready*/
#define AT91C_PA18_TIOA1    ((unsigned int) AT91C_PIO_PA18) /*  Timer Counter 1 Multipurpose Timer I/O Pin A*/
#define AT91C_PIO_PA19       ((unsigned int) 1 << 19) /* Pin Controlled by PA19*/
#define AT91C_PA19_DSR1     ((unsigned int) AT91C_PIO_PA19) /*  USART 1 Data Set ready*/
#define AT91C_PA19_TIOB1    ((unsigned int) AT91C_PIO_PA19) /*  Timer Counter 1 Multipurpose Timer I/O Pin B*/
#define AT91C_PIO_PA2        ((unsigned int) 1 <<  2) /* Pin Controlled by PA2*/
#define AT91C_PA2_SPCK     ((unsigned int) AT91C_PIO_PA2) /*  SPI Serial Clock*/
#define AT91C_PA2_PCK0     ((unsigned int) AT91C_PIO_PA2) /*  PMC Programmable clock Output 0*/
#define AT91C_PIO_PA20       ((unsigned int) 1 << 20) /* Pin Controlled by PA20*/
#define AT91C_PA20_DCD1     ((unsigned int) AT91C_PIO_PA20) /*  USART 1 Data Carrier Detect*/
#define AT91C_PA20_TIOA2    ((unsigned int) AT91C_PIO_PA20) /*  Timer Counter 2 Multipurpose Timer I/O Pin A*/
#define AT91C_PIO_PA21       ((unsigned int) 1 << 21) /* Pin Controlled by PA21*/
#define AT91C_PA21_RI1      ((unsigned int) AT91C_PIO_PA21) /*  USART 1 Ring Indicator*/
#define AT91C_PA21_TIOB2    ((unsigned int) AT91C_PIO_PA21) /*  Timer Counter 2 Multipurpose Timer I/O Pin B*/
#define AT91C_PIO_PA22       ((unsigned int) 1 << 22) /* Pin Controlled by PA22*/
#define AT91C_PA22_RXD2     ((unsigned int) AT91C_PIO_PA22) /*  USART 2 Receive Data*/
#define AT91C_PA22_URXD     ((unsigned int) AT91C_PIO_PA22) /*  USB device RXD*/
#define AT91C_PIO_PA23       ((unsigned int) 1 << 23) /* Pin Controlled by PA23*/
#define AT91C_PA23_TXD2     ((unsigned int) AT91C_PIO_PA23) /*  USART 2 Transmit Data*/
#define AT91C_PA23_UTXD     ((unsigned int) AT91C_PIO_PA23) /*  USB device TXD*/
#define AT91C_PIO_PA24       ((unsigned int) 1 << 24) /* Pin Controlled by PA24*/
#define AT91C_PA24_MCCK     ((unsigned int) AT91C_PIO_PA24) /*  Multimedia Card Clock*/
#define AT91C_PA24_RTS0     ((unsigned int) AT91C_PIO_PA24) /*  Usart 0 Ready To Send*/
#define AT91C_PIO_PA25       ((unsigned int) 1 << 25) /* Pin Controlled by PA25*/
#define AT91C_PA25_MCCDA    ((unsigned int) AT91C_PIO_PA25) /*  Multimedia Card A Command*/
#define AT91C_PA25_RTS1     ((unsigned int) AT91C_PIO_PA25) /*  Usart 0 Ready To Send*/
#define AT91C_PIO_PA26       ((unsigned int) 1 << 26) /* Pin Controlled by PA26*/
#define AT91C_PA26_MCDA0    ((unsigned int) AT91C_PIO_PA26) /*  Multimedia Card A Data 0*/
#define AT91C_PIO_PA27       ((unsigned int) 1 << 27) /* Pin Controlled by PA27*/
#define AT91C_PA27_MCDA1    ((unsigned int) AT91C_PIO_PA27) /*  Multimedia Card A Data 1*/
#define AT91C_PA27_UEON     ((unsigned int) AT91C_PIO_PA27) /*  USB Device UEON*/
#define AT91C_PIO_PA28       ((unsigned int) 1 << 28) /* Pin Controlled by PA28*/
#define AT91C_PA28_MCDA2    ((unsigned int) AT91C_PIO_PA28) /*  Multimedia Card A Data 2*/
#define AT91C_PA28_RTS2     ((unsigned int) AT91C_PIO_PA28) /*  Usart 2 Ready To Send*/
#define AT91C_PIO_PA29       ((unsigned int) 1 << 29) /* Pin Controlled by PA29*/
#define AT91C_PA29_MCDA3    ((unsigned int) AT91C_PIO_PA29) /*  Multimedia Card A Data 3*/
#define AT91C_PA29_CTS2     ((unsigned int) AT91C_PIO_PA29) /*  Usart 2 Clear To Send*/
#define AT91C_PIO_PA3        ((unsigned int) 1 <<  3) /* Pin Controlled by PA3*/
#define AT91C_PA3_NPCS0    ((unsigned int) AT91C_PIO_PA3) /*  SPI Peripheral Chip Select 0*/
#define AT91C_PA3_PCK1     ((unsigned int) AT91C_PIO_PA3) /*  PMC Programmable clock Output 1*/
#define AT91C_PIO_PA30       ((unsigned int) 1 << 30) /* Pin Controlled by PA30*/
#define AT91C_PA30_DRXD     ((unsigned int) AT91C_PIO_PA30) /*  DBGU Debug Receive Data*/
#define AT91C_PIO_PA31       ((unsigned int) 1 << 31) /* Pin Controlled by PA31*/
#define AT91C_PA31_DTXD     ((unsigned int) AT91C_PIO_PA31) /*  DBGU Debug Transmit Data*/
#define AT91C_PIO_PA4        ((unsigned int) 1 <<  4) /* Pin Controlled by PA4*/
#define AT91C_PA4_NPCS1    ((unsigned int) AT91C_PIO_PA4) /*  SPI Peripheral Chip Select 1*/
#define AT91C_PA4_USUSPEND ((unsigned int) AT91C_PIO_PA4) /*  USB device suspend*/
#define AT91C_PIO_PA5        ((unsigned int) 1 <<  5) /* Pin Controlled by PA5*/
#define AT91C_PA5_NPCS2    ((unsigned int) AT91C_PIO_PA5) /*  SPI Peripheral Chip Select 2*/
#define AT91C_PA5_SCK1     ((unsigned int) AT91C_PIO_PA5) /*  USART1 Serial Clock*/
#define AT91C_PIO_PA6        ((unsigned int) 1 <<  6) /* Pin Controlled by PA6*/
#define AT91C_PA6_NPCS3    ((unsigned int) AT91C_PIO_PA6) /*  SPI Peripheral Chip Select 3*/
#define AT91C_PA6_SCK2     ((unsigned int) AT91C_PIO_PA6) /*  USART2 Serial Clock*/
#define AT91C_PIO_PA7        ((unsigned int) 1 <<  7) /* Pin Controlled by PA7*/
#define AT91C_PA7_TWD      ((unsigned int) AT91C_PIO_PA7) /*  TWI Two-wire Serial Data*/
#define AT91C_PA7_PCK2     ((unsigned int) AT91C_PIO_PA7) /*  PMC Programmable Clock 2*/
#define AT91C_PIO_PA8        ((unsigned int) 1 <<  8) /* Pin Controlled by PA8*/
#define AT91C_PA8_TWCK     ((unsigned int) AT91C_PIO_PA8) /*  TWI Two-wire Serial Clock*/
#define AT91C_PA8_PCK3     ((unsigned int) AT91C_PIO_PA8) /*  PMC Programmable Clock 3*/
#define AT91C_PIO_PA9        ((unsigned int) 1 <<  9) /* Pin Controlled by PA9*/
#define AT91C_PA9_TXD0     ((unsigned int) AT91C_PIO_PA9) /*  USART 0 Transmit Data*/
#define AT91C_PIO_PB0        ((unsigned int) 1 <<  0) /* Pin Controlled by PB0*/
#define AT91C_PB0_TF0      ((unsigned int) AT91C_PIO_PB0) /*  SSC Transmit Frame Sync 0*/
#define AT91C_PB0_TIOB3    ((unsigned int) AT91C_PIO_PB0) /*  Timer Counter 3 Multipurpose Timer I/O Pin B*/
#define AT91C_PIO_PB1        ((unsigned int) 1 <<  1) /* Pin Controlled by PB1*/
#define AT91C_PB1_TK0      ((unsigned int) AT91C_PIO_PB1) /*  SSC Transmit Clock 0*/
#define AT91C_PB1_TCLK3    ((unsigned int) AT91C_PIO_PB1) /*  Timer Counter 3 External Clock Input*/
#define AT91C_PIO_PB10       ((unsigned int) 1 << 10) /* Pin Controlled by PB10*/
#define AT91C_PB10_RK1      ((unsigned int) AT91C_PIO_PB10) /*  SSC Receive Clock 1*/
#define AT91C_PB10_PCK1     ((unsigned int) AT91C_PIO_PB10) /*  PMC Programmable Clock Output 1*/
#define AT91C_PIO_PB11       ((unsigned int) 1 << 11) /* Pin Controlled by PB11*/
#define AT91C_PB11_RF1      ((unsigned int) AT91C_PIO_PB11) /*  SSC Receive Frame Sync 1*/
#define AT91C_PB11_TIOA4    ((unsigned int) AT91C_PIO_PB11) /*  Timer Counter 4 Multipurpose Timer I/O Pin A*/
#define AT91C_PIO_PB12       ((unsigned int) 1 << 12) /* Pin Controlled by PB12*/
#define AT91C_PB12_TF2      ((unsigned int) AT91C_PIO_PB12) /*  SSC Transmit Frame Sync 2*/
#define AT91C_PB12_TIOB5    ((unsigned int) AT91C_PIO_PB12) /*  Timer Counter 5 Multipurpose Timer I/O Pin B*/
#define AT91C_PIO_PB13       ((unsigned int) 1 << 13) /* Pin Controlled by PB13*/
#define AT91C_PB13_TK2      ((unsigned int) AT91C_PIO_PB13) /*  SSC Transmit Clock 2*/
#define AT91C_PB13_TCLK5    ((unsigned int) AT91C_PIO_PB13) /*  Timer Counter 5 external clock input*/
#define AT91C_PIO_PB14       ((unsigned int) 1 << 14) /* Pin Controlled by PB14*/
#define AT91C_PB14_TD2      ((unsigned int) AT91C_PIO_PB14) /*  SSC Transmit Data 2*/
#define AT91C_PB14_NPCS3    ((unsigned int) AT91C_PIO_PB14) /*  SPI Peripheral Chip Select 3*/
#define AT91C_PIO_PB15       ((unsigned int) 1 << 15) /* Pin Controlled by PB15*/
#define AT91C_PB15_RD2      ((unsigned int) AT91C_PIO_PB15) /*  SSC Receive Data 2*/
#define AT91C_PB15_PCK1     ((unsigned int) AT91C_PIO_PB15) /*  PMC Programmable Clock Output 1*/
#define AT91C_PIO_PB16       ((unsigned int) 1 << 16) /* Pin Controlled by PB16*/
#define AT91C_PB16_RK2      ((unsigned int) AT91C_PIO_PB16) /*  SSC Receive Clock 2*/
#define AT91C_PB16_PCK2     ((unsigned int) AT91C_PIO_PB16) /*  PMC Programmable Clock Output 2*/
#define AT91C_PIO_PB17       ((unsigned int) 1 << 17) /* Pin Controlled by PB17*/
#define AT91C_PB17_RF2      ((unsigned int) AT91C_PIO_PB17) /*  SSC Receive Frame Sync 2*/
#define AT91C_PB17_TIOA5    ((unsigned int) AT91C_PIO_PB17) /*  Timer Counter 5 Multipurpose Timer I/O Pin A*/
#define AT91C_PIO_PB18       ((unsigned int) 1 << 18) /* Pin Controlled by PB18*/
#define AT91C_PB18_RTS3     ((unsigned int) AT91C_PIO_PB18) /*  USART 3 Ready To Send*/
#define AT91C_PB18_MCCDB    ((unsigned int) AT91C_PIO_PB18) /*  Multimedia Card B Command*/
#define AT91C_PIO_PB19       ((unsigned int) 1 << 19) /* Pin Controlled by PB19*/
#define AT91C_PB19_CTS3     ((unsigned int) AT91C_PIO_PB19) /*  USART 3 Clear To Send*/
#define AT91C_PB19_MCDB0    ((unsigned int) AT91C_PIO_PB19) /*  Multimedia Card B Data 0*/
#define AT91C_PIO_PB2        ((unsigned int) 1 <<  2) /* Pin Controlled by PB2*/
#define AT91C_PB2_TD0      ((unsigned int) AT91C_PIO_PB2) /*  SSC Transmit data*/
#define AT91C_PB2_RTS2     ((unsigned int) AT91C_PIO_PB2) /*  USART 2 Ready To Send*/
#define AT91C_PIO_PB20       ((unsigned int) 1 << 20) /* Pin Controlled by PB20*/
#define AT91C_PB20_TXD3     ((unsigned int) AT91C_PIO_PB20) /*  USART 3 Transmit Data*/
#define AT91C_PB20_DTR1     ((unsigned int) AT91C_PIO_PB20) /*  USART 1 Data Terminal Ready*/
#define AT91C_PIO_PB21       ((unsigned int) 1 << 21) /* Pin Controlled by PB21*/
#define AT91C_PB21_RXD3     ((unsigned int) AT91C_PIO_PB21) /*  USART 3 Receive Data*/
#define AT91C_PIO_PB22       ((unsigned int) 1 << 22) /* Pin Controlled by PB22*/
#define AT91C_PB22_SCK3     ((unsigned int) AT91C_PIO_PB22) /*  USART 3 Serial Clock*/
#define AT91C_PB22_PCK3     ((unsigned int) AT91C_PIO_PB22) /*  PMC Programmable Clock Output 3*/
#define AT91C_PIO_PB23       ((unsigned int) 1 << 23) /* Pin Controlled by PB23*/
#define AT91C_PB23_FIQ      ((unsigned int) AT91C_PIO_PB23) /*  AIC Fast Interrupt Input*/
#define AT91C_PIO_PB24       ((unsigned int) 1 << 24) /* Pin Controlled by PB24*/
#define AT91C_PB24_IRQ0     ((unsigned int) AT91C_PIO_PB24) /*  Interrupt input 0*/
#define AT91C_PB24_TD0      ((unsigned int) AT91C_PIO_PB24) /*  SSC Transmit Data 0*/
#define AT91C_PIO_PB25       ((unsigned int) 1 << 25) /* Pin Controlled by PB25*/
#define AT91C_PB25_IRQ1     ((unsigned int) AT91C_PIO_PB25) /*  Interrupt input 1*/
#define AT91C_PB25_TD1      ((unsigned int) AT91C_PIO_PB25) /*  SSC Transmit Data 1*/
#define AT91C_PIO_PB26       ((unsigned int) 1 << 26) /* Pin Controlled by PB26*/
#define AT91C_PB26_IRQ2     ((unsigned int) AT91C_PIO_PB26) /*  Interrupt input 2*/
#define AT91C_PB26_TD2      ((unsigned int) AT91C_PIO_PB26) /*  SSC Transmit Data 2*/
#define AT91C_PIO_PB27       ((unsigned int) 1 << 27) /* Pin Controlled by PB27*/
#define AT91C_PB27_IRQ3     ((unsigned int) AT91C_PIO_PB27) /*  Interrupt input 3*/
#define AT91C_PB27_DTXD     ((unsigned int) AT91C_PIO_PB27) /*  Debug Unit Transmit Data*/
#define AT91C_PIO_PB28       ((unsigned int) 1 << 28) /* Pin Controlled by PB28*/
#define AT91C_PB28_IRQ4     ((unsigned int) AT91C_PIO_PB28) /*  Interrupt input 4*/
#define AT91C_PB28_MCDB1    ((unsigned int) AT91C_PIO_PB28) /*  Multimedia Card B Data 1*/
#define AT91C_PIO_PB29       ((unsigned int) 1 << 29) /* Pin Controlled by PB29*/
#define AT91C_PB29_IRQ5     ((unsigned int) AT91C_PIO_PB29) /*  Interrupt input 5*/
#define AT91C_PB29_MCDB2    ((unsigned int) AT91C_PIO_PB29) /*  Multimedia Card B Data 2*/
#define AT91C_PIO_PB3        ((unsigned int) 1 <<  3) /* Pin Controlled by PB3*/
#define AT91C_PB3_RD0      ((unsigned int) AT91C_PIO_PB3) /*  SSC Receive Data*/
#define AT91C_PB3_RTS3     ((unsigned int) AT91C_PIO_PB3) /*  USART 3 Ready To Send*/
#define AT91C_PIO_PB30       ((unsigned int) 1 << 30) /* Pin Controlled by PB30*/
#define AT91C_PB30_IRQ6     ((unsigned int) AT91C_PIO_PB30) /*  Interrupt input 6*/
#define AT91C_PB30_MCDB3    ((unsigned int) AT91C_PIO_PB30) /*  Multimedia Card B Data 3*/
#define AT91C_PIO_PB4        ((unsigned int) 1 <<  4) /* Pin Controlled by PB4*/
#define AT91C_PB4_RK0      ((unsigned int) AT91C_PIO_PB4) /*  SSC Receive Clock*/
#define AT91C_PB4_PCK0     ((unsigned int) AT91C_PIO_PB4) /*  PMC Programmable Clock Output 0*/
#define AT91C_PIO_PB5        ((unsigned int) 1 <<  5) /* Pin Controlled by PB5*/
#define AT91C_PB5_RF0      ((unsigned int) AT91C_PIO_PB5) /*  SSC Receive Frame Sync 0*/
#define AT91C_PB5_TIOA3    ((unsigned int) AT91C_PIO_PB5) /*  Timer Counter 4 Multipurpose Timer I/O Pin A*/
#define AT91C_PIO_PB6        ((unsigned int) 1 <<  6) /* Pin Controlled by PB6*/
#define AT91C_PB6_TF1      ((unsigned int) AT91C_PIO_PB6) /*  SSC Transmit Frame Sync 1*/
#define AT91C_PB6_TIOB4    ((unsigned int) AT91C_PIO_PB6) /*  Timer Counter 4 Multipurpose Timer I/O Pin B*/
#define AT91C_PIO_PB7        ((unsigned int) 1 <<  7) /* Pin Controlled by PB7*/
#define AT91C_PB7_TK1      ((unsigned int) AT91C_PIO_PB7) /*  SSC Transmit Clock 1*/
#define AT91C_PB7_TCLK4    ((unsigned int) AT91C_PIO_PB7) /*  Timer Counter 4 external Clock Input*/
#define AT91C_PIO_PB8        ((unsigned int) 1 <<  8) /* Pin Controlled by PB8*/
#define AT91C_PB8_TD1      ((unsigned int) AT91C_PIO_PB8) /*  SSC Transmit Data 1*/
#define AT91C_PB8_NPCS1    ((unsigned int) AT91C_PIO_PB8) /*  SPI Peripheral Chip Select 1*/
#define AT91C_PIO_PB9        ((unsigned int) 1 <<  9) /* Pin Controlled by PB9*/
#define AT91C_PB9_RD1      ((unsigned int) AT91C_PIO_PB9) /*  SSC Receive Data 1*/
#define AT91C_PB9_NPCS2    ((unsigned int) AT91C_PIO_PB9) /*  SPI Peripheral Chip Select 2*/

/* ******************************************************************************/
/*               PERIPHERAL ID DEFINITIONS FOR AT91RM3400*/
/* ******************************************************************************/
#define AT91C_ID_FIQ    ((unsigned int)  0) /* Advanced Interrupt Controller (FIQ)*/
#define AT91C_ID_SYS    ((unsigned int)  1) /* System Peripheral*/
#define AT91C_ID_PIOA   ((unsigned int)  2) /* Parallel IO Controller A */
#define AT91C_ID_PIOB   ((unsigned int)  3) /* Parallel IO Controller B*/
#define AT91C_ID_US0    ((unsigned int)  6) /* USART 0*/
#define AT91C_ID_US1    ((unsigned int)  7) /* USART 1*/
#define AT91C_ID_US2    ((unsigned int)  8) /* USART 2*/
#define AT91C_ID_US3    ((unsigned int)  9) /* USART 3*/
#define AT91C_ID_MCI    ((unsigned int) 10) /* Multimedia Card Interface*/
#define AT91C_ID_UDP    ((unsigned int) 11) /* USB Device Port*/
#define AT91C_ID_TWI    ((unsigned int) 12) /* Two-Wire Interface*/
#define AT91C_ID_SPI    ((unsigned int) 13) /* Serial Peripheral Interface*/
#define AT91C_ID_SSC0   ((unsigned int) 14) /* Serial Synchronous Controller 0*/
#define AT91C_ID_SSC1   ((unsigned int) 15) /* Serial Synchronous Controller 1*/
#define AT91C_ID_SSC2   ((unsigned int) 16) /* Serial Synchronous Controller 2*/
#define AT91C_ID_TC0    ((unsigned int) 17) /* Timer Counter 0*/
#define AT91C_ID_TC1    ((unsigned int) 18) /* Timer Counter 1*/
#define AT91C_ID_TC2    ((unsigned int) 19) /* Timer Counter 2*/
#define AT91C_ID_TC3    ((unsigned int) 20) /* Timer Counter 3*/
#define AT91C_ID_TC4    ((unsigned int) 21) /* Timer Counter 4*/
#define AT91C_ID_TC5    ((unsigned int) 22) /* Timer Counter 5*/
#define AT91C_ID_IRQ0   ((unsigned int) 25) /* Advanced Interrupt Controller (IRQ0)*/
#define AT91C_ID_IRQ1   ((unsigned int) 26) /* Advanced Interrupt Controller (IRQ1)*/
#define AT91C_ID_IRQ2   ((unsigned int) 27) /* Advanced Interrupt Controller (IRQ2)*/
#define AT91C_ID_IRQ3   ((unsigned int) 28) /* Advanced Interrupt Controller (IRQ3)*/
#define AT91C_ID_IRQ4   ((unsigned int) 29) /* Advanced Interrupt Controller (IRQ4)*/
#define AT91C_ID_IRQ5   ((unsigned int) 30) /* Advanced Interrupt Controller (IRQ5)*/
#define AT91C_ID_IRQ6   ((unsigned int) 31) /* Advanced Interrupt Controller (IRQ6)*/
#define AT91C_ALL_INT   ((unsigned int) 0xFE7FFFCF) /* ALL VALID INTERRUPTS*/

/* ******************************************************************************/
/*               BASE ADDRESS DEFINITIONS FOR AT91RM3400*/
/* ******************************************************************************/
#define AT91C_BASE_SYS       ((AT91PS_SYS) 	0xFFFFF000) /* (SYS) Base Address*/
#define AT91C_BASE_MC        ((AT91PS_MC) 	0xFFFFFF00) /* (MC) Base Address*/
#define AT91C_BASE_RTC       ((AT91PS_RTC) 	0xFFFFFE00) /* (RTC) Base Address*/
#define AT91C_BASE_ST        ((AT91PS_ST) 	0xFFFFFD00) /* (ST) Base Address*/
#define AT91C_BASE_PMC       ((AT91PS_PMC) 	0xFFFFFC00) /* (PMC) Base Address*/
#define AT91C_BASE_CKGR      ((AT91PS_CKGR) 	0xFFFFFC20) /* (CKGR) Base Address*/
#define AT91C_BASE_PIOB      ((AT91PS_PIO) 	0xFFFFF600) /* (PIOB) Base Address*/
#define AT91C_BASE_PIOA      ((AT91PS_PIO) 	0xFFFFF400) /* (PIOA) Base Address*/
#define AT91C_BASE_DBGU      ((AT91PS_DBGU) 	0xFFFFF200) /* (DBGU) Base Address*/
#define AT91C_BASE_PDC_DBGU  ((AT91PS_PDC) 	0xFFFFF300) /* (PDC_DBGU) Base Address*/
#define AT91C_BASE_AIC       ((AT91PS_AIC) 	0xFFFFF000) /* (AIC) Base Address*/
#define AT91C_BASE_PDC_SPI   ((AT91PS_PDC) 	0xFFFE0100) /* (PDC_SPI) Base Address*/
#define AT91C_BASE_SPI       ((AT91PS_SPI) 	0xFFFE0000) /* (SPI) Base Address*/
#define AT91C_BASE_PDC_SSC2  ((AT91PS_PDC) 	0xFFFD8100) /* (PDC_SSC2) Base Address*/
#define AT91C_BASE_SSC2      ((AT91PS_SSC) 	0xFFFD8000) /* (SSC2) Base Address*/
#define AT91C_BASE_PDC_SSC1  ((AT91PS_PDC) 	0xFFFD4100) /* (PDC_SSC1) Base Address*/
#define AT91C_BASE_SSC1      ((AT91PS_SSC) 	0xFFFD4000) /* (SSC1) Base Address*/
#define AT91C_BASE_PDC_SSC0  ((AT91PS_PDC) 	0xFFFD0100) /* (PDC_SSC0) Base Address*/
#define AT91C_BASE_SSC0      ((AT91PS_SSC) 	0xFFFD0000) /* (SSC0) Base Address*/
#define AT91C_BASE_PDC_US3   ((AT91PS_PDC) 	0xFFFCC100) /* (PDC_US3) Base Address*/
#define AT91C_BASE_US3       ((AT91PS_USART) 	0xFFFCC000) /* (US3) Base Address*/
#define AT91C_BASE_PDC_US2   ((AT91PS_PDC) 	0xFFFC8100) /* (PDC_US2) Base Address*/
#define AT91C_BASE_US2       ((AT91PS_USART) 	0xFFFC8000) /* (US2) Base Address*/
#define AT91C_BASE_PDC_US1   ((AT91PS_PDC) 	0xFFFC4100) /* (PDC_US1) Base Address*/
#define AT91C_BASE_US1       ((AT91PS_USART) 	0xFFFC4000) /* (US1) Base Address*/
#define AT91C_BASE_PDC_US0   ((AT91PS_PDC) 	0xFFFC0100) /* (PDC_US0) Base Address*/
#define AT91C_BASE_US0       ((AT91PS_USART) 	0xFFFC0000) /* (US0) Base Address*/
#define AT91C_BASE_TWI       ((AT91PS_TWI) 	0xFFFB8000) /* (TWI) Base Address*/
#define AT91C_BASE_PDC_MCI   ((AT91PS_PDC) 	0xFFFB4100) /* (PDC_MCI) Base Address*/
#define AT91C_BASE_MCI       ((AT91PS_MCI) 	0xFFFB4000) /* (MCI) Base Address*/
#define AT91C_BASE_UDP       ((AT91PS_UDP) 	0xFFFB0000) /* (UDP) Base Address*/
#define AT91C_BASE_TC5       ((AT91PS_TC) 	0xFFFA4080) /* (TC5) Base Address*/
#define AT91C_BASE_TC4       ((AT91PS_TC) 	0xFFFA4040) /* (TC4) Base Address*/
#define AT91C_BASE_TC3       ((AT91PS_TC) 	0xFFFA4000) /* (TC3) Base Address*/
#define AT91C_BASE_TCB1      ((AT91PS_TCB) 	0xFFFA4000) /* (TCB1) Base Address*/
#define AT91C_BASE_TC2       ((AT91PS_TC) 	0xFFFA0080) /* (TC2) Base Address*/
#define AT91C_BASE_TC1       ((AT91PS_TC) 	0xFFFA0040) /* (TC1) Base Address*/
#define AT91C_BASE_TC0       ((AT91PS_TC) 	0xFFFA0000) /* (TC0) Base Address*/
#define AT91C_BASE_TCB0      ((AT91PS_TCB) 	0xFFFA0000) /* (TCB0) Base Address*/

/* ******************************************************************************/
/*               MEMORY MAPPING DEFINITIONS FOR AT91RM3400*/
/* ******************************************************************************/
/* ISRAM*/
#define AT91C_ISRAM	 ((char *) 	0x00200000) /* Internal SRAM base address*/
#define AT91C_ISRAM_SIZE	 ((unsigned int) 0x00018000) /* Internal SRAM size in byte (96 Kbytes)*/
/* IROM*/
#define AT91C_IROM 	 ((char *) 	0x00100000) /* Internal ROM base address*/
#define AT91C_IROM_SIZE	 ((unsigned int) 0x00040000) /* Internal ROM size in byte (256 Kbytes)*/
#endif /* __IAR_SYSTEMS_ICC__ */

