una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91rm3400.h
#ifdef __IAR_SYSTEMS_ASM__

/* - Hardware register definition*/

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR System Peripherals*/
/* - ******************************************************************************/

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Memory Controller Interface*/
/* - ******************************************************************************/
/* - -------- MC_RCR : (MC Offset: 0x0) MC Remap Control Register -------- */
AT91C_MC_RCB              EQU (0x1 <<  0) ;- (MC) Remap Command Bit
/* - -------- MC_ASR : (MC Offset: 0x4) MC Abort Status Register -------- */
AT91C_MC_UNDADD           EQU (0x1 <<  0) ;- (MC) Undefined Addess Abort Status
AT91C_MC_MISADD           EQU (0x1 <<  1) ;- (MC) Misaligned Addess Abort Status
AT91C_MC_MPU              EQU (0x1 <<  2) ;- (MC) Memory protection Unit Abort Status
AT91C_MC_ABTSZ            EQU (0x3 <<  8) ;- (MC) Abort Size Status
AT91C_MC_ABTSZ_BYTE       EQU (0x0 <<  8) ;- (MC) Byte
AT91C_MC_ABTSZ_HWORD      EQU (0x1 <<  8) ;- (MC) Half-word
AT91C_MC_ABTSZ_WORD       EQU (0x2 <<  8) ;- (MC) Word
AT91C_MC_ABTTYP           EQU (0x3 << 10) ;- (MC) Abort Type Status
AT91C_MC_ABTTYP_DATAR     EQU (0x0 << 10) ;- (MC) Data Read
AT91C_MC_ABTTYP_DATAW     EQU (0x1 << 10) ;- (MC) Data Write
AT91C_MC_ABTTYP_FETCH     EQU (0x2 << 10) ;- (MC) Code Fetch
AT91C_MC_MST0             EQU (0x1 << 16) ;- (MC) Master 0 Abort Source
AT91C_MC_MST1             EQU (0x1 << 17) ;- (MC) Master 1 Abort Source
AT91C_MC_SVMST0           EQU (0x1 << 24) ;- (MC) Saved Master 0 Abort Source
AT91C_MC_SVMST1           EQU (0x1 << 25) ;- (MC) Saved Master 1 Abort Source
/* - -------- MC_PUIA : (MC Offset: 0x10) MC Protection Unit Area -------- */
AT91C_MC_PROT             EQU (0x3 <<  0) ;- (MC) Protection
AT91C_MC_PROT_PNAUNA      EQU (0x0) ;- (MC) Privilege: No Access, User: No Access
AT91C_MC_PROT_PRWUNA      EQU (0x1) ;- (MC) Privilege: Read/Write, User: No Access
AT91C_MC_PROT_PRWURO      EQU (0x2) ;- (MC) Privilege: Read/Write, User: Read Only
AT91C_MC_PROT_PRWURW      EQU (0x3) ;- (MC) Privilege: Read/Write, User: Read/Write
AT91C_MC_SIZE             EQU (0xF <<  4) ;- (MC) Internal Area Size
AT91C_MC_SIZE_1KB         EQU (0x0 <<  4) ;- (MC) Area size 1KByte
AT91C_MC_SIZE_2KB         EQU (0x1 <<  4) ;- (MC) Area size 2KByte
AT91C_MC_SIZE_4KB         EQU (0x2 <<  4) ;- (MC) Area size 4KByte
AT91C_MC_SIZE_8KB         EQU (0x3 <<  4) ;- (MC) Area size 8KByte
AT91C_MC_SIZE_16KB        EQU (0x4 <<  4) ;- (MC) Area size 16KByte
AT91C_MC_SIZE_32KB        EQU (0x5 <<  4) ;- (MC) Area size 32KByte
AT91C_MC_SIZE_64KB        EQU (0x6 <<  4) ;- (MC) Area size 64KByte
AT91C_MC_SIZE_128KB       EQU (0x7 <<  4) ;- (MC) Area size 128KByte
AT91C_MC_SIZE_256KB       EQU (0x8 <<  4) ;- (MC) Area size 256KByte
AT91C_MC_SIZE_512KB       EQU (0x9 <<  4) ;- (MC) Area size 512KByte
AT91C_MC_SIZE_1MB         EQU (0xA <<  4) ;- (MC) Area size 1MByte
AT91C_MC_SIZE_2MB         EQU (0xB <<  4) ;- (MC) Area size 2MByte
AT91C_MC_SIZE_4MB         EQU (0xC <<  4) ;- (MC) Area size 4MByte
AT91C_MC_SIZE_8MB         EQU (0xD <<  4) ;- (MC) Area size 8MByte
AT91C_MC_SIZE_16MB        EQU (0xE <<  4) ;- (MC) Area size 16MByte
AT91C_MC_SIZE_64MB        EQU (0xF <<  4) ;- (MC) Area size 64MByte
AT91C_MC_BA               EQU (0x3FFFF << 10) ;- (MC) Internal Area Base Address
/* - -------- MC_PUP : (MC Offset: 0x50) MC Protection Unit Peripheral -------- */
/* - -------- MC_PUER : (MC Offset: 0x54) MC Protection Unit Area -------- */
AT91C_MC_PUEB             EQU (0x1 <<  0) ;- (MC) Protection Unit enable Bit

/* - ******************************************************************************/
/* -              SOFTWARE API DEFINITION  FOR Real-time Clock Alarm and Parallel Load Interface*/
/* - ******************************************************************************/
/* - -------- RTC_CR : (RTC Offset: 0x0) RTC Control Register -------- */
AT91C_RTC_UPDTIM          EQU (0x1 <<  0) ;- (RTC) Update Request Time Register
AT91C_RTC_UPDCAL          EQU (0x1 <<  1) ;- (RTC) Update Request Calendar Register
AT91C_RTC_TIMEVSEL        EQU (0x3 <<  8) ;- (RTC) Time Event Selection
AT91C_RTC_TIMEVSEL_MINUTE EQU (0x0 <<  8) ;- (RTC) Minute change.
AT91C_RTC_TIMEVSEL_HOUR   EQU (0x1 <<  8) ;- (RTC) Hour change.
AT91C_RTC_TIMEVSEL_DAY24  EQU (0x2 <<  8) ;- (RTC) Every day at midnight.
AT91C_RTC_TIMEVSEL_DAY12  EQU (0x3 <<  8) ;- (RTC) Every day at noon.
AT91C_RTC_CALEVSEL        EQU (0x3 << 16) ;- (RTC) Calendar Event Selection
AT91C_RTC_CALEVSEL_WEEK   EQU (0x0 << 16) ;- (RTC) Week change (every Monday at time 00:00:00).
AT91C_RTC_CALEVSEL_MONTH  EQU (0x1 << 16) ;- (RTC) Month change (every 01 of each month at time 00:00:00).
AT91C_RTC_CALEVSEL_YEAR   EQU (0x2 << 16) ;- (RTC) Year change (every January 1 at time 00:00:00).
/* - -------- RTC_MR : (RTC Offset: 0x4) RTC Mode Register -------- */
AT91C_RTC_HRMOD           EQU (0x1 <<  0) ;- (RTC) 12-24 hour Mode
/* - -------- RTC_TIMR : (RTC Offset: 0x8) RTC Time Register -------- */
AT91C_RTC_SEC             EQU (0x7F <<  0) ;- (RTC) Current Second
AT91C_RTC_MIN             EQU (0x7F <<  8) ;- (RTC) Current Minute
AT91C_RTC_HOUR            EQU (0x3F << 16) ;- (RTC) Current Hour
AT91C_RTC_AMPM            EQU (0x1 << 22) ;- (RTC) Ante Meridiem, Post Meridiem Indicator
/* - -------- RTC_CALR : (RTC Offset: 0xc) RTC Calendar Register -------- */
AT91C_RTC_CENT            EQU (0x3F <<  0) ;- (RTC) Current Century
AT91C_RTC_YEAR            EQU (0xFF <<  8) ;- (RTC) Current Year
AT91C_RTC_MONTH           EQU (0x1F << 16) ;- (RTC) Current Month
AT91C_RTC_DAY             EQU (0x7 << 21) ;- (RTC) Current Day
AT91C_RTC_DATE            EQU (0x3F << 24) ;- (RTC) Current Date
/* - -------- RTC_TIMALR : (RTC Offset: 0x10) RTC Time Alarm Register -------- */
AT91C_RTC_SECEN           EQU (0x1 <<  7) ;- (RTC) Second Alarm Enable
AT91C_RTC_MINEN           EQU (0x1 << 15) ;- (RTC) Minute Alarm
AT91C_RTC_HOUREN          EQU (0x1 << 23) ;- (RTC) Current Hour
/* - -------- RTC_CALALR : (RTC Offset: 0x14) RTC Calendar Alarm Register -------- */
AT91C_RTC_MONTHEN         EQU (0x1 << 23) ;- (RTC) Month Alarm Enable
AT91C_RTC_DATEEN          EQU (0x1 << 31) ;- (RTC) Date Alarm Enable
/* - -------- RTC_SR : (RTC Offset: 0x18) RTC Status Register -------- */
AT91C_RTC_ACKUPD          EQU (0x1 <<  0) ;- (RTC) Acknowledge for Update
AT91C_RTC_ALARM           EQU (0x1 <<  1) ;- (RTC) Alarm Flag
AT91C_RTC_SECEV           EQU (0x1 <<  2) ;- (RTC) Second Event
AT91C_RTC_TIMEV           EQU (0x1 <<  3) ;- (RTC) Time Event
AT91C_RTC_CALEV           EQU (0x1 <<  4) ;- (RTC) Calendar event
/* - -------- RTC_SCCR : (RTC Offset: 0x1c) RTC Status Clear Command Register -------- */
/* - -------- RTC_IER : (RTC Offset: 0x20) RTC Interrupt Enable Register -------- */
/* - -------- RTC_IDR : (RTC Offset: 0x24) RTC Interrupt Disable Register -------- */
/* - -------- RTC_IMR : (RTC Offset: 0x28) RTC Interrupt Mask Register -------- */
/* - -------- RTC_VER : (RTC Offset: 0x2c) RTC Valid Entry Register -------- */
AT91C_RTC_NVTIM           EQU (0x1 <<  0) ;- (RTC) Non valid Time
AT91C_RTC_NVCAL           EQU (0x1 <<  1) ;- (RTC) Non valid Calendar
AT91C_RTC_NVTIMALR        EQU (0x1 <<  2) ;- (RTC) Non valid time Alarm
AT91C_RTC_NVCALALR        EQU (0x1 <<  3) ;- (RTC) Nonvalid Calendar Alarm

