una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91rm3400.h
/* - ******************************************************************************/
/* -               PIO DEFINITIONS FOR AT91RM3400*/
/* - ******************************************************************************/
AT91C_PIO_PA0             EQU (1 <<  0) ;- Pin Controlled by PA0
AT91C_PA0_MISO            EQU (AT91C_PIO_PA0) ;-  SPI Master In Slave
AT91C_PIO_PA1             EQU (1 <<  1) ;- Pin Controlled by PA1
AT91C_PA1_MOSI            EQU (AT91C_PIO_PA1) ;-  SPI Master Out Slave
AT91C_PIO_PA10            EQU (1 << 10) ;- Pin Controlled by PA10
AT91C_PA10_RXD0           EQU (AT91C_PIO_PA10) ;-  USART 0 Receive Data
AT91C_PA10_UTXOEN         EQU (AT91C_PIO_PA10) ;-  USB device TXOEN
AT91C_PIO_PA11            EQU (1 << 11) ;- Pin Controlled by PA11
AT91C_PA11_SCK0           EQU (AT91C_PIO_PA11) ;-  USART 0 Serial Clock
AT91C_PA11_TCLK0          EQU (AT91C_PIO_PA11) ;-  Timer Counter 0 external clock input
AT91C_PIO_PA12            EQU (1 << 12) ;- Pin Controlled by PA12
AT91C_PA12_CTS0           EQU (AT91C_PIO_PA12) ;-  USART 0 Clear To Send
AT91C_PA12_TCLK1          EQU (AT91C_PIO_PA12) ;-  Timer Counter 1 external clock input
AT91C_PIO_PA13            EQU (1 << 13) ;- Pin Controlled by PA13
AT91C_PA13_RTS0           EQU (AT91C_PIO_PA13) ;-  USART 0 Ready To Send
AT91C_PA13_TCLK2          EQU (AT91C_PIO_PA13) ;-  Timer Counter 2 external clock input
AT91C_PIO_PA14            EQU (1 << 14) ;- Pin Controlled by PA14
AT91C_PA14_RXD1           EQU (AT91C_PIO_PA14) ;-  USART 1 Receive Data
AT91C_PIO_PA15            EQU (1 << 15) ;- Pin Controlled by PA15
AT91C_PA15_TXD1           EQU (AT91C_PIO_PA15) ;-  USART 1 Transmit Data
AT91C_PIO_PA16            EQU (1 << 16) ;- Pin Controlled by PA16
AT91C_PA16_RTS1           EQU (AT91C_PIO_PA16) ;-  USART 1 Ready To Send
AT91C_PA16_TIOA0          EQU (AT91C_PIO_PA16) ;-  Timer Counter 0 Multipurpose Timer I/O Pin A
AT91C_PIO_PA17            EQU (1 << 17) ;- Pin Controlled by PA17
AT91C_PA17_CTS1           EQU (AT91C_PIO_PA17) ;-  USART 1 Clear To Send
AT91C_PA17_TIOB0          EQU (AT91C_PIO_PA17) ;-  Timer Counter 0 Multipurpose Timer I/O Pin B
AT91C_PIO_PA18            EQU (1 << 18) ;- Pin Controlled by PA18
AT91C_PA18_DTR1           EQU (AT91C_PIO_PA18) ;-  USART 1 Data Terminal ready
AT91C_PA18_TIOA1          EQU (AT91C_PIO_PA18) ;-  Timer Counter 1 Multipurpose Timer I/O Pin A
AT91C_PIO_PA19            EQU (1 << 19) ;- Pin Controlled by PA19
AT91C_PA19_DSR1           EQU (AT91C_PIO_PA19) ;-  USART 1 Data Set ready
AT91C_PA19_TIOB1          EQU (AT91C_PIO_PA19) ;-  Timer Counter 1 Multipurpose Timer I/O Pin B
AT91C_PIO_PA2             EQU (1 <<  2) ;- Pin Controlled by PA2
AT91C_PA2_SPCK            EQU (AT91C_PIO_PA2) ;-  SPI Serial Clock
AT91C_PA2_PCK0            EQU (AT91C_PIO_PA2) ;-  PMC Programmable clock Output 0
AT91C_PIO_PA20            EQU (1 << 20) ;- Pin Controlled by PA20
AT91C_PA20_DCD1           EQU (AT91C_PIO_PA20) ;-  USART 1 Data Carrier Detect
AT91C_PA20_TIOA2          EQU (AT91C_PIO_PA20) ;-  Timer Counter 2 Multipurpose Timer I/O Pin A
AT91C_PIO_PA21            EQU (1 << 21) ;- Pin Controlled by PA21
AT91C_PA21_RI1            EQU (AT91C_PIO_PA21) ;-  USART 1 Ring Indicator
AT91C_PA21_TIOB2          EQU (AT91C_PIO_PA21) ;-  Timer Counter 2 Multipurpose Timer I/O Pin B
AT91C_PIO_PA22            EQU (1 << 22) ;- Pin Controlled by PA22
AT91C_PA22_RXD2           EQU (AT91C_PIO_PA22) ;-  USART 2 Receive Data
AT91C_PA22_URXD           EQU (AT91C_PIO_PA22) ;-  USB device RXD
AT91C_PIO_PA23            EQU (1 << 23) ;- Pin Controlled by PA23
AT91C_PA23_TXD2           EQU (AT91C_PIO_PA23) ;-  USART 2 Transmit Data
AT91C_PA23_UTXD           EQU (AT91C_PIO_PA23) ;-  USB device TXD
AT91C_PIO_PA24            EQU (1 << 24) ;- Pin Controlled by PA24
AT91C_PA24_MCCK           EQU (AT91C_PIO_PA24) ;-  Multimedia Card Clock
AT91C_PA24_RTS0           EQU (AT91C_PIO_PA24) ;-  Usart 0 Ready To Send
AT91C_PIO_PA25            EQU (1 << 25) ;- Pin Controlled by PA25
AT91C_PA25_MCCDA          EQU (AT91C_PIO_PA25) ;-  Multimedia Card A Command
AT91C_PA25_RTS1           EQU (AT91C_PIO_PA25) ;-  Usart 0 Ready To Send
AT91C_PIO_PA26            EQU (1 << 26) ;- Pin Controlled by PA26
AT91C_PA26_MCDA0          EQU (AT91C_PIO_PA26) ;-  Multimedia Card A Data 0
AT91C_PIO_PA27            EQU (1 << 27) ;- Pin Controlled by PA27
AT91C_PA27_MCDA1          EQU (AT91C_PIO_PA27) ;-  Multimedia Card A Data 1
AT91C_PA27_UEON           EQU (AT91C_PIO_PA27) ;-  USB Device UEON
AT91C_PIO_PA28            EQU (1 << 28) ;- Pin Controlled by PA28
AT91C_PA28_MCDA2          EQU (AT91C_PIO_PA28) ;-  Multimedia Card A Data 2
AT91C_PA28_RTS2           EQU (AT91C_PIO_PA28) ;-  Usart 2 Ready To Send
AT91C_PIO_PA29            EQU (1 << 29) ;- Pin Controlled by PA29
AT91C_PA29_MCDA3          EQU (AT91C_PIO_PA29) ;-  Multimedia Card A Data 3
AT91C_PA29_CTS2           EQU (AT91C_PIO_PA29) ;-  Usart 2 Clear To Send
AT91C_PIO_PA3             EQU (1 <<  3) ;- Pin Controlled by PA3
AT91C_PA3_NPCS0           EQU (AT91C_PIO_PA3) ;-  SPI Peripheral Chip Select 0
AT91C_PA3_PCK1            EQU (AT91C_PIO_PA3) ;-  PMC Programmable clock Output 1
AT91C_PIO_PA30            EQU (1 << 30) ;- Pin Controlled by PA30
AT91C_PA30_DRXD           EQU (AT91C_PIO_PA30) ;-  DBGU Debug Receive Data
AT91C_PIO_PA31            EQU (1 << 31) ;- Pin Controlled by PA31
AT91C_PA31_DTXD           EQU (AT91C_PIO_PA31) ;-  DBGU Debug Transmit Data
AT91C_PIO_PA4             EQU (1 <<  4) ;- Pin Controlled by PA4
AT91C_PA4_NPCS1           EQU (AT91C_PIO_PA4) ;-  SPI Peripheral Chip Select 1
AT91C_PA4_USUSPEND        EQU (AT91C_PIO_PA4) ;-  USB device suspend
AT91C_PIO_PA5             EQU (1 <<  5) ;- Pin Controlled by PA5
AT91C_PA5_NPCS2           EQU (AT91C_PIO_PA5) ;-  SPI Peripheral Chip Select 2
AT91C_PA5_SCK1            EQU (AT91C_PIO_PA5) ;-  USART1 Serial Clock
AT91C_PIO_PA6             EQU (1 <<  6) ;- Pin Controlled by PA6
AT91C_PA6_NPCS3           EQU (AT91C_PIO_PA6) ;-  SPI Peripheral Chip Select 3
AT91C_PA6_SCK2            EQU (AT91C_PIO_PA6) ;-  USART2 Serial Clock
AT91C_PIO_PA7             EQU (1 <<  7) ;- Pin Controlled by PA7
AT91C_PA7_TWD             EQU (AT91C_PIO_PA7) ;-  TWI Two-wire Serial Data
AT91C_PA7_PCK2            EQU (AT91C_PIO_PA7) ;-  PMC Programmable Clock 2
AT91C_PIO_PA8             EQU (1 <<  8) ;- Pin Controlled by PA8
AT91C_PA8_TWCK            EQU (AT91C_PIO_PA8) ;-  TWI Two-wire Serial Clock
AT91C_PA8_PCK3            EQU (AT91C_PIO_PA8) ;-  PMC Programmable Clock 3
AT91C_PIO_PA9             EQU (1 <<  9) ;- Pin Controlled by PA9
AT91C_PA9_TXD0            EQU (AT91C_PIO_PA9) ;-  USART 0 Transmit Data
AT91C_PIO_PB0             EQU (1 <<  0) ;- Pin Controlled by PB0
AT91C_PB0_TF0             EQU (AT91C_PIO_PB0) ;-  SSC Transmit Frame Sync 0
AT91C_PB0_TIOB3           EQU (AT91C_PIO_PB0) ;-  Timer Counter 3 Multipurpose Timer I/O Pin B
AT91C_PIO_PB1             EQU (1 <<  1) ;- Pin Controlled by PB1
AT91C_PB1_TK0             EQU (AT91C_PIO_PB1) ;-  SSC Transmit Clock 0
AT91C_PB1_TCLK3           EQU (AT91C_PIO_PB1) ;-  Timer Counter 3 External Clock Input
AT91C_PIO_PB10            EQU (1 << 10) ;- Pin Controlled by PB10
AT91C_PB10_RK1            EQU (AT91C_PIO_PB10) ;-  SSC Receive Clock 1
AT91C_PB10_PCK1           EQU (AT91C_PIO_PB10) ;-  PMC Programmable Clock Output 1
AT91C_PIO_PB11            EQU (1 << 11) ;- Pin Controlled by PB11
AT91C_PB11_RF1            EQU (AT91C_PIO_PB11) ;-  SSC Receive Frame Sync 1
AT91C_PB11_TIOA4          EQU (AT91C_PIO_PB11) ;-  Timer Counter 4 Multipurpose Timer I/O Pin A
AT91C_PIO_PB12            EQU (1 << 12) ;- Pin Controlled by PB12
AT91C_PB12_TF2            EQU (AT91C_PIO_PB12) ;-  SSC Transmit Frame Sync 2
AT91C_PB12_TIOB5          EQU (AT91C_PIO_PB12) ;-  Timer Counter 5 Multipurpose Timer I/O Pin B
AT91C_PIO_PB13            EQU (1 << 13) ;- Pin Controlled by PB13
AT91C_PB13_TK2            EQU (AT91C_PIO_PB13) ;-  SSC Transmit Clock 2
AT91C_PB13_TCLK5          EQU (AT91C_PIO_PB13) ;-  Timer Counter 5 external clock input
AT91C_PIO_PB14            EQU (1 << 14) ;- Pin Controlled by PB14
AT91C_PB14_TD2            EQU (AT91C_PIO_PB14) ;-  SSC Transmit Data 2
AT91C_PB14_NPCS3          EQU (AT91C_PIO_PB14) ;-  SPI Peripheral Chip Select 3
AT91C_PIO_PB15            EQU (1 << 15) ;- Pin Controlled by PB15
AT91C_PB15_RD2            EQU (AT91C_PIO_PB15) ;-  SSC Receive Data 2
AT91C_PB15_PCK1           EQU (AT91C_PIO_PB15) ;-  PMC Programmable Clock Output 1
AT91C_PIO_PB16            EQU (1 << 16) ;- Pin Controlled by PB16
AT91C_PB16_RK2            EQU (AT91C_PIO_PB16) ;-  SSC Receive Clock 2
AT91C_PB16_PCK2           EQU (AT91C_PIO_PB16) ;-  PMC Programmable Clock Output 2
AT91C_PIO_PB17            EQU (1 << 17) ;- Pin Controlled by PB17
AT91C_PB17_RF2            EQU (AT91C_PIO_PB17) ;-  SSC Receive Frame Sync 2
AT91C_PB17_TIOA5          EQU (AT91C_PIO_PB17) ;-  Timer Counter 5 Multipurpose Timer I/O Pin A
AT91C_PIO_PB18            EQU (1 << 18) ;- Pin Controlled by PB18
AT91C_PB18_RTS3           EQU (AT91C_PIO_PB18) ;-  USART 3 Ready To Send
AT91C_PB18_MCCDB          EQU (AT91C_PIO_PB18) ;-  Multimedia Card B Command
AT91C_PIO_PB19            EQU (1 << 19) ;- Pin Controlled by PB19
AT91C_PB19_CTS3           EQU (AT91C_PIO_PB19) ;-  USART 3 Clear To Send
AT91C_PB19_MCDB0          EQU (AT91C_PIO_PB19) ;-  Multimedia Card B Data 0
AT91C_PIO_PB2             EQU (1 <<  2) ;- Pin Controlled by PB2
AT91C_PB2_TD0             EQU (AT91C_PIO_PB2) ;-  SSC Transmit data
AT91C_PB2_RTS2            EQU (AT91C_PIO_PB2) ;-  USART 2 Ready To Send
AT91C_PIO_PB20            EQU (1 << 20) ;- Pin Controlled by PB20
AT91C_PB20_TXD3           EQU (AT91C_PIO_PB20) ;-  USART 3 Transmit Data
AT91C_PB20_DTR1           EQU (AT91C_PIO_PB20) ;-  USART 1 Data Terminal Ready
AT91C_PIO_PB21            EQU (1 << 21) ;- Pin Controlled by PB21
AT91C_PB21_RXD3           EQU (AT91C_PIO_PB21) ;-  USART 3 Receive Data
AT91C_PIO_PB22            EQU (1 << 22) ;- Pin Controlled by PB22
AT91C_PB22_SCK3           EQU (AT91C_PIO_PB22) ;-  USART 3 Serial Clock
AT91C_PB22_PCK3           EQU (AT91C_PIO_PB22) ;-  PMC Programmable Clock Output 3
AT91C_PIO_PB23            EQU (1 << 23) ;- Pin Controlled by PB23
AT91C_PB23_FIQ            EQU (AT91C_PIO_PB23) ;-  AIC Fast Interrupt Input
AT91C_PIO_PB24            EQU (1 << 24) ;- Pin Controlled by PB24
AT91C_PB24_IRQ0           EQU (AT91C_PIO_PB24) ;-  Interrupt input 0
AT91C_PB24_TD0            EQU (AT91C_PIO_PB24) ;-  SSC Transmit Data 0
AT91C_PIO_PB25            EQU (1 << 25) ;- Pin Controlled by PB25
AT91C_PB25_IRQ1           EQU (AT91C_PIO_PB25) ;-  Interrupt input 1
AT91C_PB25_TD1            EQU (AT91C_PIO_PB25) ;-  SSC Transmit Data 1
AT91C_PIO_PB26            EQU (1 << 26) ;- Pin Controlled by PB26
AT91C_PB26_IRQ2           EQU (AT91C_PIO_PB26) ;-  Interrupt input 2
AT91C_PB26_TD2            EQU (AT91C_PIO_PB26) ;-  SSC Transmit Data 2
AT91C_PIO_PB27            EQU (1 << 27) ;- Pin Controlled by PB27
AT91C_PB27_IRQ3           EQU (AT91C_PIO_PB27) ;-  Interrupt input 3
AT91C_PB27_DTXD           EQU (AT91C_PIO_PB27) ;-  Debug Unit Transmit Data
AT91C_PIO_PB28            EQU (1 << 28) ;- Pin Controlled by PB28
AT91C_PB28_IRQ4           EQU (AT91C_PIO_PB28) ;-  Interrupt input 4
AT91C_PB28_MCDB1          EQU (AT91C_PIO_PB28) ;-  Multimedia Card B Data 1
AT91C_PIO_PB29            EQU (1 << 29) ;- Pin Controlled by PB29
AT91C_PB29_IRQ5           EQU (AT91C_PIO_PB29) ;-  Interrupt input 5
AT91C_PB29_MCDB2          EQU (AT91C_PIO_PB29) ;-  Multimedia Card B Data 2
AT91C_PIO_PB3             EQU (1 <<  3) ;- Pin Controlled by PB3
AT91C_PB3_RD0             EQU (AT91C_PIO_PB3) ;-  SSC Receive Data
AT91C_PB3_RTS3            EQU (AT91C_PIO_PB3) ;-  USART 3 Ready To Send
AT91C_PIO_PB30            EQU (1 << 30) ;- Pin Controlled by PB30
AT91C_PB30_IRQ6           EQU (AT91C_PIO_PB30) ;-  Interrupt input 6
AT91C_PB30_MCDB3          EQU (AT91C_PIO_PB30) ;-  Multimedia Card B Data 3
AT91C_PIO_PB4             EQU (1 <<  4) ;- Pin Controlled by PB4
AT91C_PB4_RK0             EQU (AT91C_PIO_PB4) ;-  SSC Receive Clock
AT91C_PB4_PCK0            EQU (AT91C_PIO_PB4) ;-  PMC Programmable Clock Output 0
AT91C_PIO_PB5             EQU (1 <<  5) ;- Pin Controlled by PB5
AT91C_PB5_RF0             EQU (AT91C_PIO_PB5) ;-  SSC Receive Frame Sync 0
AT91C_PB5_TIOA3           EQU (AT91C_PIO_PB5) ;-  Timer Counter 4 Multipurpose Timer I/O Pin A
AT91C_PIO_PB6             EQU (1 <<  6) ;- Pin Controlled by PB6
AT91C_PB6_TF1             EQU (AT91C_PIO_PB6) ;-  SSC Transmit Frame Sync 1
AT91C_PB6_TIOB4           EQU (AT91C_PIO_PB6) ;-  Timer Counter 4 Multipurpose Timer I/O Pin B
AT91C_PIO_PB7             EQU (1 <<  7) ;- Pin Controlled by PB7
AT91C_PB7_TK1             EQU (AT91C_PIO_PB7) ;-  SSC Transmit Clock 1
AT91C_PB7_TCLK4           EQU (AT91C_PIO_PB7) ;-  Timer Counter 4 external Clock Input
AT91C_PIO_PB8             EQU (1 <<  8) ;- Pin Controlled by PB8
AT91C_PB8_TD1             EQU (AT91C_PIO_PB8) ;-  SSC Transmit Data 1
AT91C_PB8_NPCS1           EQU (AT91C_PIO_PB8) ;-  SPI Peripheral Chip Select 1
AT91C_PIO_PB9             EQU (1 <<  9) ;- Pin Controlled by PB9
AT91C_PB9_RD1             EQU (AT91C_PIO_PB9) ;-  SSC Receive Data 1
AT91C_PB9_NPCS2           EQU (AT91C_PIO_PB9) ;-  SPI Peripheral Chip Select 2

