una1veritas/Workspace/STM32-E_revB1_demo/IAR/arm/inc/Atmel/ioat91rm3400.h
/* - ******************************************************************************/
/* -               PERIPHERAL ID DEFINITIONS FOR AT91RM3400*/
/* - ******************************************************************************/
AT91C_ID_FIQ              EQU ( 0) ;- Advanced Interrupt Controller (FIQ)
AT91C_ID_SYS              EQU ( 1) ;- System Peripheral
AT91C_ID_PIOA             EQU ( 2) ;- Parallel IO Controller A 
AT91C_ID_PIOB             EQU ( 3) ;- Parallel IO Controller B
AT91C_ID_US0              EQU ( 6) ;- USART 0
AT91C_ID_US1              EQU ( 7) ;- USART 1
AT91C_ID_US2              EQU ( 8) ;- USART 2
AT91C_ID_US3              EQU ( 9) ;- USART 3
AT91C_ID_MCI              EQU (10) ;- Multimedia Card Interface
AT91C_ID_UDP              EQU (11) ;- USB Device Port
AT91C_ID_TWI              EQU (12) ;- Two-Wire Interface
AT91C_ID_SPI              EQU (13) ;- Serial Peripheral Interface
AT91C_ID_SSC0             EQU (14) ;- Serial Synchronous Controller 0
AT91C_ID_SSC1             EQU (15) ;- Serial Synchronous Controller 1
AT91C_ID_SSC2             EQU (16) ;- Serial Synchronous Controller 2
AT91C_ID_TC0              EQU (17) ;- Timer Counter 0
AT91C_ID_TC1              EQU (18) ;- Timer Counter 1
AT91C_ID_TC2              EQU (19) ;- Timer Counter 2
AT91C_ID_TC3              EQU (20) ;- Timer Counter 3
AT91C_ID_TC4              EQU (21) ;- Timer Counter 4
AT91C_ID_TC5              EQU (22) ;- Timer Counter 5
AT91C_ID_IRQ0             EQU (25) ;- Advanced Interrupt Controller (IRQ0)
AT91C_ID_IRQ1             EQU (26) ;- Advanced Interrupt Controller (IRQ1)
AT91C_ID_IRQ2             EQU (27) ;- Advanced Interrupt Controller (IRQ2)
AT91C_ID_IRQ3             EQU (28) ;- Advanced Interrupt Controller (IRQ3)
AT91C_ID_IRQ4             EQU (29) ;- Advanced Interrupt Controller (IRQ4)
AT91C_ID_IRQ5             EQU (30) ;- Advanced Interrupt Controller (IRQ5)
AT91C_ID_IRQ6             EQU (31) ;- Advanced Interrupt Controller (IRQ6)
AT91C_ALL_INT             EQU (0xFE7FFFCF) ;- ALL VALID INTERRUPTS

/* - ******************************************************************************/
/* -               BASE ADDRESS DEFINITIONS FOR AT91RM3400*/
/* - ******************************************************************************/
AT91C_BASE_SYS            EQU (0xFFFFF000) ;- (SYS) Base Address
AT91C_BASE_MC             EQU (0xFFFFFF00) ;- (MC) Base Address
AT91C_BASE_RTC            EQU (0xFFFFFE00) ;- (RTC) Base Address
AT91C_BASE_ST             EQU (0xFFFFFD00) ;- (ST) Base Address
AT91C_BASE_PMC            EQU (0xFFFFFC00) ;- (PMC) Base Address
AT91C_BASE_CKGR           EQU (0xFFFFFC20) ;- (CKGR) Base Address
AT91C_BASE_PIOB           EQU (0xFFFFF600) ;- (PIOB) Base Address
AT91C_BASE_PIOA           EQU (0xFFFFF400) ;- (PIOA) Base Address
AT91C_BASE_DBGU           EQU (0xFFFFF200) ;- (DBGU) Base Address
AT91C_BASE_PDC_DBGU       EQU (0xFFFFF300) ;- (PDC_DBGU) Base Address
AT91C_BASE_AIC            EQU (0xFFFFF000) ;- (AIC) Base Address
AT91C_BASE_PDC_SPI        EQU (0xFFFE0100) ;- (PDC_SPI) Base Address
AT91C_BASE_SPI            EQU (0xFFFE0000) ;- (SPI) Base Address
AT91C_BASE_PDC_SSC2       EQU (0xFFFD8100) ;- (PDC_SSC2) Base Address
AT91C_BASE_SSC2           EQU (0xFFFD8000) ;- (SSC2) Base Address
AT91C_BASE_PDC_SSC1       EQU (0xFFFD4100) ;- (PDC_SSC1) Base Address
AT91C_BASE_SSC1           EQU (0xFFFD4000) ;- (SSC1) Base Address
AT91C_BASE_PDC_SSC0       EQU (0xFFFD0100) ;- (PDC_SSC0) Base Address
AT91C_BASE_SSC0           EQU (0xFFFD0000) ;- (SSC0) Base Address
AT91C_BASE_PDC_US3        EQU (0xFFFCC100) ;- (PDC_US3) Base Address
AT91C_BASE_US3            EQU (0xFFFCC000) ;- (US3) Base Address
AT91C_BASE_PDC_US2        EQU (0xFFFC8100) ;- (PDC_US2) Base Address
AT91C_BASE_US2            EQU (0xFFFC8000) ;- (US2) Base Address
AT91C_BASE_PDC_US1        EQU (0xFFFC4100) ;- (PDC_US1) Base Address
AT91C_BASE_US1            EQU (0xFFFC4000) ;- (US1) Base Address
AT91C_BASE_PDC_US0        EQU (0xFFFC0100) ;- (PDC_US0) Base Address
AT91C_BASE_US0            EQU (0xFFFC0000) ;- (US0) Base Address
AT91C_BASE_TWI            EQU (0xFFFB8000) ;- (TWI) Base Address
AT91C_BASE_PDC_MCI        EQU (0xFFFB4100) ;- (PDC_MCI) Base Address
AT91C_BASE_MCI            EQU (0xFFFB4000) ;- (MCI) Base Address
AT91C_BASE_UDP            EQU (0xFFFB0000) ;- (UDP) Base Address
AT91C_BASE_TC5            EQU (0xFFFA4080) ;- (TC5) Base Address
AT91C_BASE_TC4            EQU (0xFFFA4040) ;- (TC4) Base Address
AT91C_BASE_TC3            EQU (0xFFFA4000) ;- (TC3) Base Address
AT91C_BASE_TCB1           EQU (0xFFFA4000) ;- (TCB1) Base Address
AT91C_BASE_TC2            EQU (0xFFFA0080) ;- (TC2) Base Address
AT91C_BASE_TC1            EQU (0xFFFA0040) ;- (TC1) Base Address
AT91C_BASE_TC0            EQU (0xFFFA0000) ;- (TC0) Base Address
AT91C_BASE_TCB0           EQU (0xFFFA0000) ;- (TCB0) Base Address

/* - ******************************************************************************/
/* -               MEMORY MAPPING DEFINITIONS FOR AT91RM3400*/
/* - ******************************************************************************/
/* - ISRAM*/
AT91C_ISRAM               EQU (0x00200000) ;- Internal SRAM base address
AT91C_ISRAM_SIZE          EQU (0x00018000) ;- Internal SRAM size in byte (96 Kbytes)
/* - IROM*/
AT91C_IROM                EQU (0x00100000) ;- Internal ROM base address
AT91C_IROM_SIZE           EQU (0x00040000) ;- Internal ROM size in byte (256 Kbytes)
#endif /* __IAR_SYSTEMS_ASM__ */


#endif /* AT91RM3400_H */
